{
  "texts": [
    "# CIC-IDS2017 数据集介绍",
    "## 数据集概述",
    "CIC-IDS2017是由加拿大网络安全研究所开发的网络入侵检测数据集，包含5天的正常和恶意网络流量",
    "## 主要特点",
    "- 包含280万条网络流量记录",
    "- 覆盖多种常见攻击类型：DDoS、暴力破解、Web攻击等",
    "- 使用CICFlowMeter工具提取80个流量特征",
    "- 提供完整的PCAP文件和CSV特征文件",
    "## 已知问题",
    "- 标注错误率约6.67%，部分攻击类错误率超过95%",
    "- TCP流构建存在缺陷，产生25.9%的无效\"TCP附录流\"",
    "- 特征提取工具CICFlowMeter违反RFC标准",
    "- 大量空载荷流量被错误标注为攻击",
    "网络攻击类型分类：",
    "1. DDoS攻击",
    "- LOIC和HOIC工具生成的洪水攻击",
    "- 特征：高流量、高包速率、源IP分布广泛",
    "2. Web攻击",
    "- SQL注入、XSS跨站脚本、暴力破解",
    "- 特征：异常HTTP请求、重复登录尝试",
    "3. 暴力破解",
    "- SSH、FTP、Telnet协议暴力破解",
    "- 特征：多次认证失败、短时间密集连接",
    "4. Botnet攻击",
    "- 僵尸网络C&C通信",
    "- 特征：周期性心跳包、加密通信模式",
    "5. 渗透攻击",
    "- 端口扫描、漏洞利用",
    "- 特征：非常规端口访问、异常载荷",
    "Error Prevalence in NIDS datasets: A Case Study on",
    "CIC-IDS-2017 and CSE-CIC-IDS-2018",
    "Lisa Liu1*, Gints Engelen2*, Timothy Lynar1, Daryl Essam1, Wouter Joosen2",
    "1University of New South Wales, Canberra",
    "{l.liuthorrold, t.lynar, d.essam}@adfa.edu.au",
    "2imec-DistriNet, KU Leuven",
    "{gints.engelen, wouter.joosen}@kuleuven.be",
    "Abstract —Benchmark datasets are heavily depended upon by",
    "the research community to validate theoretical findings and track",
    "progression in the state-of-the-art. NIDS dataset creation presents",
    "numerous challenges on account of the volume, heterogeneity, and",
    "complexity of network traffic, making the process labor intensive,",
    "and thus, prone to error. This paper provides a critical review",
    "of CIC-IDS-2017 and CIC-CSE-IDS-2018, datasets which have",
    "seen extensive usage in the NIDS literature, and are currently",
    "considered primary benchmarking datasets for NIDS. We report",
    "a large number of previously undocumented errors throughout",
    "the dataset creation lifecycle, including in attack orchestration,",
    "feature generation, documentation, and labeling.",
    "The errors destabilize the results and challenge the findings",
    "of numerous publications that have relied on it as a benchmark.",
    "We demonstrate the implications of these errors through several",
    "experiments. We provide comprehensive documentation to sum-",
    "marize the discovery of these issues, as well as a fully-recreated",
    "dataset, with labeling logic that has been reverse-engineered,",
    "corrected, and made publicly available for the first time. We",
    "demonstrate the implications of dataset errors through a series of",
    "experiments. The findings serve to remind the research community",
    "of common pitfalls with dataset creation processes, and of the need",
    "to be vigilant when adopting new datasets. Lastly, we strongly",
    "recommend the release of labeling logic for any dataset released,",
    "to ensure full transparency.",
    "Index Terms—network intrusion detection, datasets, CIC-IDS-",
    "2017, CSE-CIC-IDS-2018.",
    "I. I NTRODUCTION",
    "Network Intrusion Detection systems (NIDS) form an inte-",
    "gral part of the cybersecurity posture of any entity looking",
    "to safeguard their assets. Given the increasing complexity,",
    "heterogeneity, and volume of network traffic, it is not surprising",
    "that there is and has been great interest in using machine and",
    "deep learning models as tools that might inform cybersecurity",
    "threats. A critical component of assessing the models developed",
    "is evaluating their performance on datasets, which should",
    "reflect real-world conditions, in order to provide a realistic",
    "indicator of predictive capability. Datasets reflecting authentic",
    "network traffic in the wild cannot be gathered as they can",
    "in other domains, where datasets could be assembled from a",
    "variety of open sources. Organizations are often reluctant to",
    "release network traffic datasets because of the sensitive and",
    "confidential data they carry, whether explicit in the traffic pay-",
    "load, or implicit in the connection meta-data. To navigate the",
    "*Co-first authors.issue of inaccessibility to authentic traffic datasets, researchers",
    "have turned to creating their own datasets as a proxy to real-",
    "world network traffic using controlled test environments with",
    "synthesized attacks.",
    "Among the first datasets provided to the research community",
    "were the DARPA [1] and it’s derivative, KDD Cup ‘99 [2]",
    "datasets, which served as long-standing benchmarks for NIDS",
    "research. Both contributions allowed for the first time meaning-",
    "ful comparison of different approaches and advanced the field",
    "significantly. However neither datasets have been immune to",
    "criticism [3], [4]. The criticisms centered on the presence of",
    "simulation artifacts, redundant records, data corruptions, mis-",
    "alignment to production network architectures, and with pas-",
    "sage of time, lack of contemporary relevance. NSL-KDD [5],",
    "an improved iteration of KDD, resolved the redundant record",
    "issue, and became the successive mainstay benchmark dataset",
    "for NIDS research, alongside UNSW-NB15 [6], CICIDS-2017",
    "[7], CSE-CIC-IDS-2018 [8], and BoT-IoT [9]. These datasets",
    "have been released as post-processed forms of raw network",
    "traces, and have been labeled for easy pairing with machine",
    "learning algorithms. The authors justify the contributions of",
    "these datasets by emphasizing the need for contemporary attack",
    "scenarios, larger network configurations, and a richer feature",
    "set for machine learning algorithms. The primary form of",
    "validation for these datasets comes from their demonstrated",
    "ability to differentiate between malicious and benign flows",
    "using machine learning algorithms.",
    "With these datasets providing a large number of records -",
    "for example, UNSW-NB15 and CICIDS-2017 contain close to",
    "2,000,000 records, and CSE-CIC-IDS-2018 has an excess of",
    "over 16,000,000 records - there is no alternative but to apply",
    "an automated labelling process. This is usually done through",
    "a combination of time and host-based filtering to separate",
    "malicious traffic [10]. Formulating the logic is a key component",
    "of label generation, a manual and laborious process, due to the",
    "quantity and complexity of data involved, making it susceptible",
    "to errors if not handled carefully. The validity of the labeling",
    "(ground-truth) has, to our best knowledge, not been established.",
    "The problem has adverse implications for the field. The",
    "number of datasets for benchmarking Network Intrusion Detec-",
    "tion Systems (NIDS) has proliferated dramatically to meet the",
    "current conditions of local and global network traffic, which2022 IEEE Conference on Communications and Network Security (CNS)",
    "978-1-6654-6255-6/22/$31.00 ©2022 IEEE 2542022 IEEE Conference on Communications and Network Security (CNS) | 978-1-6654-6255-6/22/$31.00 ©2022 IEEE | DOI: 10.1109/CNS56114.2022.9947235",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "has undergone drastic changes due to sweeping technological",
    "innovations in recent years. It is often the case that these",
    "datasets are released without an intensive external validation",
    "process, and are then directly adopted by users, resulting in",
    "misleading claims of extrapolated efficacy in the case that",
    "datasets are found defective.",
    "With the number of issues that are discovered in the CICIDS-",
    "2017 dataset [11], [12], the extent to which CSE-CIC-IDS",
    "2018 has been compromised by the same issues, as well as",
    "other undiscovered problems, will be of interest, given the",
    "lineage to CIC-IDS 2017. Both datasets have served as the",
    "primary benchmark in many recent published studies [13]–",
    "[21]. A pairing of CIC-IDS 2017 and CSE-CIC-IDS 2018",
    "also provides a unique opportunity to assess generalization",
    "capabilities of developed models based on similar dataset",
    "constructions in benign and attack traffic [22], [23]. The two",
    "datasets are distinguished by their testbed configuration and",
    "deployment environment, which serve to represent real-world",
    "scenarios where datasets may be trained in one environment",
    "and deployed to another.",
    "We perform a rigorous methodological manual analysis to",
    "determine the extent to which both datasets are affected by",
    "labeling issues. To our best knowledge, our work represents the",
    "first to attempt to reverse-engineer the closed-source labeling",
    "logic for these datasets from raw .pcap files. In summary, the",
    "contributions of the work are as follows:",
    "•We identify a large number of previously undocumented",
    "errors throughout the CIC-IDS 2017 and CSE-CIC-IDS",
    "2018 dataset creation lifecycle, including in attack orches-",
    "tration, feature generation, documentation, and labeling.",
    "•We provide completely reconstructed datasets that are free",
    "of artifacts and use a corrected labeling logic that has been",
    "engineered by manually analysing over 630 GB of raw",
    "traffic and 31.14 GB of CSV flow data.",
    "•The new datasets include corrected implementations of",
    "existing features, and provide new features that capture",
    "valuable flow state information, which is not provided by",
    "the current feature extraction tool.",
    "•We demonstrate the effect of dataset errors through a",
    "series of experiments.",
    "II. B ACKGROUND AND RELATED WORK",
    "A. Datasets",
    "The CSE-CIC-IDS 2018 dataset is published by the Uni-",
    "versity of New Brunswick through a collaboration between",
    "the Communications Security Establishment (CSE) and the",
    "Canadian Institute of Cybersecurity (CIC). The dataset fol-",
    "lows the CICIDS2017, ISCXIDS2012, and NSL-KDD datasets",
    "released by the same research institution, all of which have",
    "been extensively used for NIDS benchmarking. Each iteration",
    "expanded the capabilities of the previous version through",
    "larger network testbeds, or new attack scenarios. CSE-CIC-",
    "IDS 2018 was largely unchanged from the 2017 iteration, with",
    "the exception of moving the testbed to Amazon Web Services",
    "cloud infrastructure and increasing the number of simulatedclients in subnetworks. The attacks contained within the 2017",
    "iteration are mostly retained in the 2018 version.",
    "The dataset itself consists of 10 days of traffic, presented",
    "in .csv format, with 79 features extracted through the CI-",
    "CFlowMeter Extraction tool [24], [25]. The flows are bi-",
    "directional, defined by the 5-tuple {Source IP , Destination IP ,",
    "Source Port, Destination Port, Protocol }, with the first packet",
    "in the flow defining the forward direction. A flow is terminated",
    "by a user specified timeout, or by TCP connection semantics.",
    "The main flow features include values (time, data, packet",
    "rates), their statistics (min, max, mean, standard deviation,",
    "variance), and indicator variables for TCP header flags. The",
    "labeling is categorized by attack type, enabling both multi-",
    "class and binary classification. Benign traffic is produced from",
    "B-Profiles which extract human behavior into encapsulated",
    "features. For example, distribution of packet sizes of a protocol,",
    "number of packets per flow, and certain patterns in the payload.",
    "According to the documentation [26], [27], B-Profiles are used",
    "by an in-house, closed-source Java application to generate",
    "realistic network traffic in the backdrop of traffic noise over the",
    "following protocols: HTTPS, HTTP, SMTP, POP3, IMAP, SSH,",
    "and FTP. There are no further details about how benign traffic",
    "is generated. For example, the sampling duration, the network",
    "environment of profiled users, or statistical details of simulated",
    "behavior are not readily apparent. The attack scenarios are",
    "described in their documentation [26], [27].",
    "B. Related Work",
    "NIDS datasets have often been analyzed in the literature.",
    "A comprehensive survey of datasets relevant to network-based",
    "intrusion detection is presented by [28]. Despite the review’s",
    "good coverage of the many datasets available, the comparisons",
    "rely on published documentation to illustrate differences be-",
    "tween datasets, which themselves are limited in accuracy to",
    "what is contained therein. In [29], the authors conducted a",
    "similar study, and raised cursory issues such as the size of",
    "the dataset, missing or duplicate records, and class-imbalance.",
    "A recent review of studies involving CSE-CIC-IDS 2018 up",
    "to 2020 can be found in [30]. We draw attention to several",
    "studies in the review where the levels of accuracy, precision,",
    "and recall have reached 100%. As we later demonstrate, it is",
    "highly unlikely that the stated performance can be achieved",
    "without overfitting to the dataset, given the level of label con-",
    "tamination we observe. The inability to extrapolate conclusions",
    "beyond the performance of the datasets themselves reveals",
    "limited insight into real-world performance. [31] reached a",
    "similar conclusion, based on the observed biased nature of",
    "the datasets. In their statistical analysis of CIC-IDS 2017 and",
    "UNSW-NB15, among others, they found that a number of the",
    "features were over-correlated with anomalous classes and that",
    "the probability distributions between attacks and normal traffic",
    "differed substantially. They conclude that these datasets should",
    "not be used as a benchmark for creating novel anomaly-based",
    "network intrusion detection systems, given that these features",
    "alone were deemed sufficient to make a distinction between",
    "benign and malicious traffic.2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "III. M ETHODOLOGY",
    "CSE-CIC-IDS 2018 is published without certain features",
    "which enable reconciliation of .csv flow features with raw",
    "packet traces from .pcap files. These include: Flow-IDs,",
    "Source/Destination IPs, and Source Port Numbers. Following",
    "our contact, the dataset authors provided the complete .csv",
    "files with the missing fields, but were unable to supply the",
    "scripts used to label the flows in either dataset. The authors in",
    "this study subsequently use the documentation located at [26],",
    "[27] as the primary reference points for reverse engineering",
    "the correct labeling logic for both datasets. The study was",
    "conducted by two authors over a period of 5 months, during",
    "which each attack was manually examined in great detail. Both",
    "authors have previously analyzed a number of NIDS datasets,",
    "including raw .pcap files over the past 2.5 years.",
    "Each author independently performed the manual analysis.",
    "The scope of work included locating evidence of each attack",
    "in the raw .pcap files, identifying labeling inconsistencies in",
    "the published versions with reference to packet traces, and",
    "examining the published .csv files, containing extracted flows",
    "from the CICFlowMeter tool [25], for accuracy in feature",
    "extraction. Independent findings were mutually verified before",
    "coming to a consensus on the final labeling scripts, with",
    "multiple rounds of cross-validation during each stage of the",
    "study. The new labeling logic was then applied to the original",
    "dataset. Inconsistencies between the new ground truth and the",
    "original published labels were manually verified. Following",
    "modifications to the CICFlowMeter tool to incorporate correc-",
    "tions to faulty implementation of existing features, addition of",
    "stateful features, removal of artifacts, the new datasets were",
    "regenerated. After application of the corrected labeling logic",
    "to the regenerated datasets, the new datasets were re-evaluated",
    "following the same procedure. The methodology was used to",
    "analyse both CIC-IDS 2017 and CSE-CIC-IDS 2018 datasets.",
    "IV. E VALUATION RESULTS",
    "In this section, we first provide a quantitative summary of",
    "issues found within each dataset. A summary of modifications",
    "made to the CICFlowMeter tool is then provided. This is",
    "followed by experiments examining their impact on learning",
    "behavior in machine and deep learning algorithms. Finally, the",
    "results of an inquiry into the automated detection of labeling",
    "errors are presented.",
    "A. Quantitative Summary of Issues",
    "The quantitative assessment covers attack label omissions,",
    "significant label reassignments, and the issue of ambiguous",
    "class labels (class overlap). Our analysis is based on the pub-",
    "lished version of CIC-IDS 2017, and on the fullversion of CSE-",
    "CIC-IDS 2018 (which includes the omitted columns of Flow-",
    "ID, Source/Destination IPs and Source Port), obtained after cor-",
    "respondence with the authors. We discover that the published",
    "version of CSE-CIC-IDS 2018 is only an approximate 25%",
    "subset (16,232,963 flows) of the fullversion. We remove rows",
    "containing invalid numeric values. The calculations hereafterare based only on the flow counts of rows with valid numerical",
    "values (cleaned flow count). Statistics of the analyzed datasets",
    "are presented in Table I.",
    "TABLE I",
    "DATASET STATISTICS",
    "Year Published Flows Cleaned Flows CSV Volume PCAP Traffic",
    "Count Count GB GB",
    "2017 2,830,743 2,827,726 1.09 GB 48.8 GB",
    "2018 65,042,705 64,561,010 30.05 GB 582 GB",
    "1) Attacks Missed By Published Version: Table II summa-",
    "rizes the number of malicious flows that are missed in the",
    "original dataset. The issue is important, since the dataset is",
    "severely imbalanced in favor of benign traffic. Flow count",
    "gains are especially significant for attacks that are challenged",
    "by a minority representation in the dataset. Imprecise time",
    "frames account for some of the missed flows. Some attacks",
    "were missed entirely, e.g. several rounds of Port Scanning",
    "(2017, 2018). Some labels were assigned to the incorrect attack.",
    "Substantial gains are accounted for by considering several",
    "issues which lead to an unexpected direction in flow initiation,",
    "see Section IV-B. In the published dataset versions, the labels",
    "are mostly considered in one direction only.",
    "TABLE II",
    "ATTACK LABELS MISSED INPUBLISHED VERSION",
    "2017 2018",
    "Attack Count∗%Gain∗Count∗%Gain∗",
    "DDoS LOIC [128,025] +31,339 24.48% - -",
    "DDoS HOIC - - [1,246,034] +918,543 73.72%",
    "DoS GoldenEye [10,293] +203 1.97% - -",
    "DoS Hulk [230,124] +3,680 1.60% [923,824] +884,408 95.73%",
    "DoS Slow HTTP [5,499] +163 2.96% - -",
    "DoS Slowloris [5796] +10 0.17% - -",
    "FTP Patator [7,935] +19 0.24% - -",
    "Heartbleed [11] +1 9.09% - -",
    "Infiltration [36] +4 11.11% [160,639] +63,381 39.46%",
    "Port Scan [158,804] +61,003 38.41% - -",
    "SSH Patator [5,897] +1 0.02% [187,589] +389 0.21%",
    "Web Brute Force [1,507] +1 0.07% - -",
    "Web SQL Injection [21] +3 14.29% [87] +1 1.15%",
    "Web XSS [652] +2 0.31% [230] +2 0.87%",
    "*Values with reference to label counts in the published dataset.",
    "2) Significant Label Reassignments: The discovery of la-",
    "belling issues in the original datasets leads to a number of label",
    "reassignments. Table III presents the instances where corruption",
    "to the published label exceeds 5% of the label’s total flow",
    "count. Extremely high corruption rates can be observed for",
    "many attacks, in both datasets. The table does not represent",
    "the entirety of all label reassignments as many fall below the",
    "5% corruption rate. We provide below a brief summary of main",
    "factors leading to label re-assignment.",
    "•Empty Payload The primary contributions to this cate-",
    "gory are “TCP Appendices” [11]. There are also flows",
    "with only TCP start and finish sequences and no traffic in",
    "between.",
    "•Port/System closed Malicious traffic does not reach vic-",
    "tim target due to it being down or unavailable.2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "TABLE III",
    "LABEL REASSIGNMENTS : CORRUPTIONS >5%",
    "Year Published Label Revised Label % Corruption*Remarks*",
    "2017 Bot Botnet - Attempted 25.05% Port/System Closed. Continued C&C connection at-",
    "tempts by victim after attack terminated at the published",
    "time, and C&C is no longer reachable (presumably shut",
    "down).",
    "DoS GoldenEye DoS GoldenEye - Attempted 25.06% Empty Payload",
    "DoS Hulk DoS Hulk - Attempted 32.70% No malicious payload (4.47%)",
    "Empty Payload (28.23%)",
    "Attack artifacts (0.001%)",
    "DoS Slow HTTP DoS Slow HTTP - Attempted 56.34% Empty Payload (5.13%)",
    "Target Unresponsive (51.19%)",
    "Attack startup/ tear down artifact (0.02%)",
    "DoS Slowloris DoS Slowloris - Attempted 29.65% Empty Payload (29.55%)",
    "Attack startup/ tear down artifact (0.10%)",
    "FTP-Patator FTP-Patator - Attempted 49.93% No malicious payload (49.69%)",
    "Empty Payload (0.20%)",
    "Attack startup/ tear down artifact (0.04%)",
    "SSH-Patator SSH-Patator - Attempted 49.80% No malicious payload",
    "Web - Brute Force Web - Brute Force - Attempted 95.16% Empty Payload (89.85%)",
    "Attack startup/ teardown artifact (0.60%)",
    "Attack artifact (4.71%)",
    "Web Attack - XSS Web Attack - XSS - Attempted 94.48% Attack startup/tear down artifact (0.61%)",
    "Empty Payload (93.87%)",
    "2018 Bot Botnet Ares - Attempted 50.06% Empty Payload. No evidence of Botnet Zeus found",
    "during traffic analysis. Affected by TSO issue.",
    "Web - Brute Force Web - Brute Force - Attempted 53.85% Empty Payload (30.77%)",
    "Attack startup/ tear down artifact (2.46%)",
    "Attack Implemented Incorrectly (20.62%) - Flows with",
    "only single login requests do not qualify as ‘brute force’",
    "in the context of a single flow",
    "Web - Brute Force Benign 24.71% Mixture of empty flows comprising TCP handshake only,",
    "and browsing traffic not specifically related to the attack.",
    "Web Attack - XSS Web Attack - XSS - Attempted 50.43% Attack startup/tear down artifact (1.30%)",
    "Empty Payload (48.26%)",
    "No malicious payload (0.87%)",
    "DDoS HOIC DDoS HOIC - Attempted 86.86% Empty Payload",
    "DDoS LOIC-HTTP DDoS LOIC-UDP 0.14% (LOIC)",
    "46.07% (UDP)All DDoS LOIC-UDP flows on 20-02-2018 are misla-",
    "beled as DDoS LOIC-HTTP",
    "DDoS LOIC-HTTP DDoS-LOIC-HTTP - Attempted 49.65% Empty Payload",
    "DoS GoldenEye DoS GoldenEye - Attempted 33.22% Empty Payload (33.09%)",
    "Target Unresponsive (0.13%)",
    "DoS Hulk DoS Hulk - Attempted 94.47% Empty Payload",
    "DoS Slow HTTP FTP-Patator - Attempted 100% Attack mislabeled. Traffic shows TCP connection at-",
    "tempts to port 21 which appears to be closed",
    "DoS Slowloris DoS Slowloris - Attempted 21.88% Empty Payload",
    "FTP-Patator FTP-Patator - Attempted 100% Port/System Closed. Unsure if this was an accidental",
    "oversight. All TCP ‘Syn’ connection attempts to victim",
    "host/port are responded to with ‘RST’.",
    "Infiltration Benign 76.84% Hosts not involved in the attack are classified as infiltra-",
    "tion. Suspect severe contamination of background traffic",
    "due to time-based labelling",
    "SQL Injection SQL Injection - Attempted 54.02% Empty Payload (36.78%). Some flows in this category",
    "occur in the timeframe of another attack.",
    "Attack startup/tear down artifact (17.24%)",
    "SSH-Patator SSH-Patator - Attempted 49.97% Empty Payload",
    "*Values accurate at time of publication. For the full table (including corruptions <5%), refer to https://intrusion-detection.",
    "distrinet-research.be/CNS2022/ . There may be minor residual corrections post-publication.2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "•Attack startup/teardown artifact Traffic with no mali-",
    "cious semantics. They are related to launching or termi-",
    "nating the attack. For example in FTP Patator (2017), the",
    "traffic suggests a successful trial login takes place before",
    "the start of the attack. It is possible that the dataset author",
    "is verifying that the victim is configured correctly for the",
    "attack. Most web-based attacks require a first visit to the",
    "landing page of DVWA (vulnerable web-app) installed on",
    "the victim server, before proceeding to the appropriate",
    "page to load the attack. Due to the absence of malicious",
    "payload in this phase, they appear semantically identical",
    "to a benign user browsing the web-app, within the context",
    "of a single flow.",
    "•No malicious payload Payload exists, but without mali-",
    "cious content. For example, some long TCP connections",
    "are split into multiple flows due to exceeding the timeout",
    "of the CICFlowMeter tool (set at 120 seconds). These",
    "partitioned flows created by flow timeouts do not always",
    "contain malicious traffic. Other flow types in this category",
    "include re-transmission of small segments without mali-",
    "cious components, and flows with RST packets that are",
    "technically affiliated TCP appendices.",
    "•Attack artifact Traffic occurring between attacker and",
    "victim, but unrelated to the attack. For example, dur-",
    "ing the Web-Brute Force attack (2017), a HTTP GET",
    "request to the page /dv/vulnerabilties/xss_r/",
    "is made with every HTTP POST login request to",
    "/dv/login.php. The consecutive HTTP requests are",
    "split into separate flows, the former with no malicious",
    "brute force content. Our manual replication of the login",
    "attempt to the specified page with our own setup of DVWA",
    "does not yield the same traffic patterns",
    "the unrelated",
    "HTTP GET request may be an introduced programmatic",
    "artifact during attack execution.",
    "•Target system unresponsive The target is unresponsive,",
    "suggesting that it may be overwhelmed. This is distin-",
    "guished from Port/System closed, where a RST packet",
    "is returned to the sender. Flows in this category consist",
    "primarily of TCP ‘Syn’ packets submitted to the victim",
    "host through TCP re-tranmission mechanisms.",
    "•Time-Based labeling Without accurate host and port",
    "filtering, time-based labeling leads to traffic not involved",
    "in the attack being labeled as malicious flows. This gave",
    "rise to high levels of contamination to Infiltration (2018),",
    "and Web-Brute Force (2018).",
    "3) Ambiguous Class Label: We identify a number of flows",
    "which, once flow identifying features [Flow Id, Source IP,",
    "Source Port, Destination IP, Timestamp] are removed, share",
    "overlap with other classes, presented in Table IV. This has",
    "several consequences. First, the presence of TCP appendix",
    "artifacts is a systematic issue that affects all TCP flows.",
    "Artifacts of this type are found in almost all classes, and share",
    "similar characteristics. The second is a result of mislabelling.",
    "Recall from Table IV that the DoS SlowHTTPtest attack is",
    "entirely mislabeled. The raw packet trace analysis from .pcapTABLE IV",
    "AMBIGUOUS LABEL COUNTS",
    "Year Attack Overlap Class # Overlap",
    "2017 DDoS Benign 6",
    "DoS Hulk Benign 4,872",
    "DoS Slowloris Benign 1",
    "Portscan Benign 1,053",
    "2018 Brute Force - Web Benign 1",
    "Web - Brute Force Infiltration 7",
    "Web Attack - XSS Benign 1",
    "Web Attack - XSS SQL Injection 1",
    "DoS Slow HTTP FTP-Patator 100,760",
    "DoS Slow HTTP SSH-Patator 89,438",
    "FTP-Patator SSH-Patator 169,745",
    "Infiltration Benign 36,889",
    "files during this period reveals FTP connection attempts to",
    "an inactive host/port. Third, due to a number of incorrectly",
    "implemented columns in the CICFlowMeter tool used at the",
    "time the datasets were generated, additional features that could",
    "provide flow disambiguation between classes fail to be ex-",
    "pressed accurately, if at all, in the affected fields.",
    "B. Modifications to CICFlowMeter Tool",
    "In this section, we summarize key issues/changes with the",
    "CICFlowMeter that are pertinent to flow integrity and attack",
    "characterization. Corrections where possible have been made1.",
    "•Packet timestamping issue As an example, in FTP-",
    "Patator (2017), we observed some ‘Syn Ack’ packets from",
    "the victim arrive (in the temporally-ordered trace) before",
    "the initiating ‘Syn’ packets from the attacker. The result",
    "is an unexpected initiation of flows from the victim. Local",
    "network interface cards (NICS), which are then combined",
    "into one logical NIC, are likely to cause this issue, since",
    "timestamping occurs on the OS where the local NICS",
    "reside. This issue is likely to surface in volumetric attacks.",
    "To remedy this, a dataset creator should verify both",
    "directions of traffic when labeling flows.",
    "•TCP segmentation offset issue A valid IP packet from an",
    "interface performing TCP segmentation offloading (TSO)",
    "may have an IP length of 0 in the header. Since packet",
    "headers currently determine how packets are dissected,",
    "affected packets are dissected incorrectly. As a result,",
    "packets that would usually be assigned to the correct flow,",
    "are instead separated out into their own flow with source",
    "and destination ports set to 0 (‘unknown payload’). Mul-",
    "tiple flows between the same set of hosts, with different",
    "ports, occuring in the same timeframe, will also have any",
    "TSO packets collected into the same ‘unknown payload’",
    "flow. This is likely to affect attacks with large payloads.",
    "1The corrected CICFlowMeter tool can be found at https://github.",
    "com/GintsEngelen/CICFlowMeter2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "Observed in Heartbleed (2018) and Botnet Ares (2018).",
    "Our release contains a modification to the jnetpcap",
    "library used by the CICFlowMeter to address this issue.",
    "•Correct calculations of existing attributes Issues in this",
    "category were due to erroneous implementation in the",
    "original version of the CICFlowMeter tool. The affected",
    "features are therefore inaccurate representations of reality.",
    "•New attributes",
    "1)Add total TCP flow duration. A user can now identify",
    "whether a CIC Flow belongs to a sustained TCP",
    "connection. The use of lengthened TCP connections",
    "is particularly relevant to low rate DoS attacks that",
    "are designed to exhaust a victim’s connection pool.",
    "2)Support for ICMP protocol. The ICMP protocol is",
    "not supported by the original CICFlowMeter. Unde-",
    "livered IP packets may be embedded and returned to",
    "the sender through ICMP, which is then incorrectly",
    "interpreted. A regular flow is subsequently created",
    "using the Source and Destination IP addresses of the",
    "ICMP packet, and the protocol, port, and payload",
    "information in the encapsulated, undelivered packet.",
    "3)Fwd/Bwd RST flag counts introduced. Anomalous",
    "activity may be indicated by direction of RST flags.",
    "4)UTC timestamp with micro-second precision. The",
    "timestamp is standardized to UTC, rather than to",
    "the local host running the Flow Meter. This removes",
    "ambiguity when datasets are analyzed from different",
    "time zones. With microsecond precision, it is possi-",
    "ble to identify the exact packet that initiated a flow",
    "in the raw .pcap files. Precise packet reconciliation",
    "facilitates attribution to unexpected observations.",
    "C. Impact on Training",
    "In this section we study the cumulative impact of issues",
    "present in the CIC-IDS 2017 and CIC-CSE-IDS 2018 datasets.",
    "We evaluate the impact of labeling errors on standard ML/DL",
    "algorithms, since judgment of validity cannot be cast on",
    "existing state-of-the-art-methods. As we discuss later below,",
    "existing methods that perform well on the published versions of",
    "the datasets, with the levels of labeling contamination observed",
    "in this study, are likely demonstrating their ability to fit to",
    "the chosen dataset, rather than ability to learn appropriate",
    "representations to solve the problem at hand. First, we discuss",
    "differences in feature representation on Machine Learning al-",
    "gorithms, followed by the impact on training of Deep Learning",
    "Algorithms.",
    "1) Differences in Feature Representation: To analyze differ-",
    "ences in feature representation of attacks between the published",
    "and newly generated datasets, we select Random Forest, a ML",
    "classifier which consistently stands out as a high-performing",
    "algorithm in NIDS research [32]–[37]. From the 2017 and 2018",
    "dataset versions, we select 2 attacks each with high corruption",
    "rates. The analysis procedure is as follows: For all datasets,",
    "we first drop flow-identifying columns. We also drop columns",
    "that are strongly correlated with others, determined by usingPearson correlation, with a coefficient of 0.9 as the threshold.",
    "We then calculate the baseline performance for each version of",
    "the dataset. Afterwards, we systematically remove one feature,",
    "retrain the classifier, and recompute the Precision, Recall, and",
    "F1 scores. We repeat this for all features.",
    "We interpret a feature’s importance by the impact it has on",
    "Precision, Recall, and F1 values to the baseline metrics when",
    "that feature is removed. Figure 1 illustrates the reduction in F1",
    "scores when each feature is removed. The selected features in",
    "the figure represent the top fivefeatures for each class, from",
    "each version of the dataset (published/released), giving a total",
    "oftenfeatures for comparison in each attack. Baseline Recall",
    "and F1 results (using the full set of decorrelated columns)",
    "for each attack are presented to the right of the subplots. In",
    "observing impact to F1 scores, both in terms of feature types",
    "and contribution level, one can view differences in learning",
    "representations when dataset artifacts and labeling corruptions",
    "are present. These differences result in elevated Recall and F1",
    "performance for nearly all cases in the corrected version.",
    "It is possible to see differences in learning representation",
    "even when the metrics for a given attack are quite comparable",
    "in both dataset versions, e.g. 2017 DoS Slow HTTP. Typically,",
    "Destination Port andForward Initial Window Bytes are promi-",
    "nent features for many attacks in the published versions of the",
    "datasets, including the DoS Slow HTTP. We establish a link to",
    "these features through the presence of artifacts, which outweigh",
    "the quantity of genuine malicious flows. For many attacks, the",
    "importance of Destination Port and Forward Initial Window",
    "Bytes strongly diminishes in the corrected dataset versions.",
    "Several other interesting observations can be made. Firstly,",
    "we observe some attributes have a negative impact on classifi-",
    "cation performance (i.e. drop in F1 score when the feature is",
    "removed). Due to the overlap in distributions of values to other",
    "classes, not all features lead to quality predictive indicators for",
    "the target class. This is likely to have occurred in DoS Slowloris",
    "(2018, published version) due to mislabeling or the presence",
    "of artifacts within the values for the affected features. The",
    "second observation is that singular feature importance drops",
    "substantially in the corrected versions of the datasets. In other",
    "words, dropping single features in an independent run resulted",
    "in no change to model performance for most of the features,",
    "and for many attacks. On one hand, this can be interpreted as an",
    "encouraging sign, since strong attachment to singular features",
    "may be symptomatic of shortcut learning. When a variable",
    "is dropped without changing the model, it indicates that the",
    "information needed for classification can be provided by one",
    "or more of the remaining variables. We consider two scenarios:",
    "1. Multi-collinearity between other features 2. Extremely low",
    "intra-class variability for many of the attacks, due to their",
    "scripted nature. This leads to more or less consistent values",
    "within features (for several features) for a given attack. In light",
    "of our empirical observations of the datasets in purified form,",
    "we hypothesize that (2) is the most likely explanation.",
    "2) Impact on Deep Learning Training: To gain insight into",
    "how dataset issues impact Deep Learning algorithms, we study2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "2017 - Botnet (1)",
    "0 0.005 0.01 0.015 0.02",
    "F1 Score DeclineDst PortDown/Up RatioBwd Init Win BytesActive MaxProtocolFlow DurationTotal Fwd PacketsFwd Packet Length MaxFlow IAT MeanFlow IAT Min2017 - DoS Slow HTTP (2)",
    "-0.01 0 0.01 0.02 0.03 0.04",
    "F1 Score DeclineFwd Bytes/Bulk AvgBwd Init Win BytesFlow DurationBwd Packet Length MinFlow Bytes/sDst PortInit Win Bytes FwdAct Data Pkt FwdFwd Avg Packets BulkFwd Avg Bulk Rate",
    "2018 - DoS Slowloris (3)",
    "-0.04 -0.02 0 0.02 0.04 0.06 0.08",
    "F1 Score DeclineFwd Packet Length MaxFwd Bulk Rate AvgFlow DurationTotal Fwd PacketTotal Bwd PacketsDest PortFwd Packet Length MinProtocolMin Seg Size FwdInit Win Bytes Bwd2018 - DoS GoldenEye (4)",
    "0 0.02 0.04 0.06 0.08 0.1",
    "F1 Score DeclineIdle StdFwd IAT MeanActive StdFwd Seg Size MinActive MeanDest PortInit Win Bytes FwdFlow Packets/sBwd Packet Length MinFlow DurationNew Dataset",
    "Published Version",
    "Recall    Pub.       New",
    "1            39.67     100",
    "2            99.27     99.54",
    "3            90.86     100",
    "4            99.93     100",
    "F1        Pub.       New",
    "1           56.81     100",
    "2           98.91     99.43",
    "3           95.19     100",
    "4           99.96     99.99 Fig. 1. Learning Representation Differences - Random Forest",
    "0 10 20 30",
    "Epoch020406080100120140Average LossBotnet",
    "0 10 20 30",
    "Epoch246810Average LossDoS GoldenEye",
    "0 10 20 30",
    "Epoch00.10.20.30.40.50.6Average LossDoS Hulk",
    "0 10 20 30",
    "Epoch102030405060Average LossDoS Slow HTTP Test",
    "0 10 20 30",
    "Epoch510152025303540Average LossDoS Slowloris",
    "0 10 20 30",
    "Epoch05101520Average LossFTP Patator",
    "0 10 20 30",
    "Epoch0500100015002000250030003500Average LossWeb Attack - Brute Force",
    "0 10 20 30",
    "Epoch00.511.522.5Average Loss104 Web Attack - XSS",
    "0 10 20 30",
    "Epoch0510152025Average LossSSH Patator",
    "0 10 20 30",
    "Epoch1234567Average Loss104Web Attack - SQL InjectionNew Dataset",
    "Published Version",
    "Early Stopping Point",
    "Fig. 2. CIC-IDS2017 Average Categorical Cross-Entropy Losses vs. Epochs Comparison",
    "and compare the training losses for each attack between the",
    "published versions and our corrected versions. The intuition is",
    "that the learning behavior of a class can be reflected through",
    "their training losses [38]. The configuration of a Multilayer",
    "Perceptron was derived through hyper-parameter optimization,",
    "using the Hyperband algorithm [39]. The final architecture is",
    "a standard MLP with 4 hidden layers. For each version of the",
    "dataset, we track the sample-wise training loss for each training",
    "epoch, up to a total of 30 epochs. The early stopping point",
    "for models trained on each version of the dataset is marked",
    "in red on the corresponding subplots of Figures 2 and 3. The",
    "early stopping point is determined by an increase in validation",
    "loss, with a patience of 3 epochs. The categorical cross entropy",
    "losses are weighted according to class sizes.",
    "Figures 2 and 3 illustrate the individual sample losses,",
    "aggregated by attacks for each version of the dataset (2017 and",
    "2018, respectively). In general, we can observe lower training",
    "losses for the corrected dataset versions in nearly all attacks,",
    "indicating increased stability in training, with corrected labelingand removal of artifacts. In the cases where training losses",
    "in the corrected version of the dataset exceed the losses in",
    "the published version, most are impacted by their minority",
    "representation in the main datasets. The removal of artifacts",
    "and incorrectly labeled flows further reduces their flow count",
    "availability, which increases the training difficulty. In these",
    "scenarios, they correctly reflect an increased training difficulty",
    "on minority classes, without artifact contamination.",
    "For the DoS Slow HTTP Test (2017) example, we observe",
    "a higher average training loss in the corrected version of the",
    "dataset, compared with the published version. In our inves-",
    "tigation, we found that the training loss progression of the",
    "published version of DoS Slow HTTP aligns closer to the train-",
    "ing loss progression of ‘DoS Slow HTTP - Attempted’ in the",
    "corrected version. This suggests that the learning representation",
    "of the DoS Slow HTTP Test may be tied to TCP appendices",
    "in the MLP trained on published versions of the dataset. Once",
    "these are removed, the training losses are calibrated to the true",
    "learning difficulty of this attack.2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "0 10 20 30",
    "Epoch100200300400500600700Average LossDoS Slowloris",
    "0 10 20 30",
    "Epoch00.511.52Average Loss105Web Attack - Brute Force",
    "0 10 20 30",
    "Epoch1.21.41.61.822.2Average Loss105Web Attack - XSS",
    "0 10 20 30",
    "Epoch00.10.20.30.40.50.6Average LossDDoS - HOIC",
    "0 10 20 30",
    "Epoch0100020003000400050006000Average LossDDoS - LOIC-UDP",
    "0 10 20 30",
    "Epoch0.40.60.811.21.4Average LossDDoS - LOIC-HTTP",
    "0 10 20 30",
    "Epoch00.20.40.60.81Average LossDoS Hulk",
    "0 10 20 30",
    "Epoch20406080100Average LossGoldenEye",
    "0 10 20 30",
    "Epoch11.522.533.54Average LossSSH Patator",
    "0 10 20 30",
    "Epoch4681012Average Loss105Web Attack - SQL InjectionNew Dataset",
    "Published Version",
    "Early Stopping PointFig. 3. CSE-CIC-IDS2018 Average Categorical Cross-Entropy Losses vs. Epochs Comparison",
    "D. Automated Detection of Labelling Errors",
    "Manual reverse engineering and correction of labeling logic",
    "provide us with a ground-truth reference point from which to",
    "investigate the possibility of automated detection of labeling",
    "errors in the two datasets. We select two state of the art",
    "methods, Confident Learning [40], and O2U-Net [38] that have",
    "been used to detect labeling errors in the field of computing",
    "vision. As the base algorithm for Confident Learning, we use",
    "Random Forest. The MLP configuration from the previous sub-",
    "section is used as base model for O2U-Net. The ground-truth",
    "for comparison is generated by applying our corrected labeling",
    "logic to the published datasets (in the case of CIC-CSE-IDS",
    "2018, the fullversion).",
    "In Table V, the mismatch counts to ground-truth are shown",
    "for the published versions, as well as the labels as predicted by",
    "Confident Learning and O2U-net. The baseline label corruption",
    "levels (i.e. the published versions of the dataset) sit at 6.67%",
    "and 7.53% for 2017 and 2018, respectively. The mismatch",
    "counts for Confident Learning are comparable to the baseline",
    "corruption levels, with slight decreases for both 2017 and 2018.",
    "The mismatch counts are considerably high for O2U-Net in",
    "both cases. We speculate that in addition to the presence of the",
    "artifacts, deep learning algorithms are less robust to dealing",
    "with severe data imbalances. This is despite using hyper-",
    "parameter optimzed networks, with weighted losses. On the",
    "contrary, as earlier discussed, there is a difference in learning",
    "representations between a clean dataset, and one in which",
    "artifacts are present. It is possible that exposure to artifacts",
    "in the Random Forest classifier contributes to its tendency to",
    "present mismatch counts in close proximity to the published",
    "versions. This suggests that Confident Learning can detect only",
    "spurious labeling errors.",
    "While both methods are model agnostic, their performances",
    "are reliant upon the underlying algorithm’s ability to extract",
    "optimal semantic representations. We conclude that both meth-",
    "ods are challenged by the presence of dataset artifacts and are",
    "unable to offer substantial improvements to the correction of",
    "labeling errors in CIC-IDS 2017 and CSE-CIC-IDS 2018.TABLE V",
    "AUTOMATED LABEL ERROR DETECTION",
    "2017 2018",
    "Total Flows 2,827,726 64,561,010",
    "Incorrectly labeled Count % Mismatch Count %Mismatch",
    "Published Version (Baseline) 188,571 6.67% 4,862,181 7.53%",
    "Confident Learning [40] 188,489 6.67% 4,781,570 7.40%",
    "O2U-Net [38] 412,330 14.58% 12,655,025 19.60%",
    "V. D ISCUSSION",
    "Implications of Ambiguous Label Counts. It is not uncom-",
    "mon to find datasets with ambiguous labels. Usually, they",
    "arise from subjectivity in human interpretation for contentious",
    "samples. This is especially the case for the field of computing",
    "vision. It is more unusual to see post-processed samples from",
    "different traffic scenarios presenting identical values for every",
    "field in the extracted flows. In these datasets, the findings",
    "suggest that the ambiguous labels are caused by a mixture of",
    "artifact presence and labeling inaccuracies. In general however,",
    "this is symptomatic of an underlying feature representation",
    "problem. Feature extraction techniques that produce identical",
    "features with multi-class assignments, that should not exist,",
    "implies that the engineered features are insufficient for effective",
    "training with Machine and Deep Learning algorithms. The",
    "effects in our study show some degree of training destabiliza-",
    "tion. However, when samples with class overlap surface in the",
    "testing/validation partitions of the dataset, this makes theoret-",
    "ical 100% accuracy impossible, since a single sample cannot",
    "be simultaneously several labels in a single class prediction",
    "problem. It is possible to avoid the latter problem by removing",
    "duplicate rows before commencing the ML pipeline, but it does",
    "not address the underlying issue of a feature representation",
    "problem. There is no guarantee that the behavior of learning",
    "algorithms on unseen samples will be predictable.",
    "Implications on Learning Representations. The automated",
    "process of labeling records raises the possibility that machine",
    "learning algorithms learn features that reflect the logic of",
    "the labeling process rather than relevant characteristics that2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "delineate benign from malicious records. Recent studies have",
    "demonstrated that models may overfit to patterns in the data,",
    "including patterns associated with systematic labeling errors",
    "[41], or even a random labeling of data [42]. Both forms of",
    "learning are capable of delivering high levels of performance.",
    "Learning the former provides an unrealistic estimation of the",
    "model’s performance in the field, as well as being detrimental",
    "to any generalization capability the model is able to provide.",
    "Practitioners will not be able to differentiate between the two",
    "cases without detailed information on the labeling strategy. This",
    "issue is further obscured by the volumetric and imbalanced",
    "nature of these datasets. When feature reduction, a standard",
    "technique in the ML pipeline is used, these problems are",
    "exacerbated further because the algorithms may focus more",
    "disproportionately on irrelevant features.",
    "A further consequence of incorrect learning representa-",
    "tions caused by dataset issues, is erroneous conclusions in",
    "extrapolated efficacy, as well as incorrect interpretation of",
    "technique performance. As an example, the Infiltration attack",
    "in CSE-CIC-IDS-2018 suffers from severely high levels of",
    "label corruption, an attack that has been identified as no-",
    "toriously difficult to detect [32]. A researcher may be led",
    "to optimise toward perceived algorithmic deficiencies rather",
    "than recognise that the level of contamination makes this an",
    "impossible task. In view of these findings, we believe that",
    "new metrics must be developed to evaluate the performance of",
    "ML/DL NIDS research, since methods that benchmark well,",
    "the current qualification for state-of-the-art, may be invalid",
    "by virtue of learning inappropriate representations to solve",
    "the problem at hand. For example, measures of generalization",
    "capability may offer a more accurate representation of real-",
    "world performance, allowing us to disqualify methods that",
    "perform well on benchmark datasets only.",
    "Implications on NIDS research. NIDS dataset paper",
    "releases have kept labeling logic closed source as standard",
    "practice. This is problematic for several reasons. A user",
    "cannot easily verify the simulated environment has been",
    "adequately controlled for the artifacts it generates. Among",
    "many others, these include background traffic between attack",
    "and victim machines during attacks, simulation tool artifacts,",
    "and anomalous behavioral manifestations by the machines",
    "following completion of the main attack. It is our strong",
    "recommendation that any future dataset releases undergo an",
    "external, independent validation process before they can be",
    "accepted as a valid benchmark dataset for NIDS research. To",
    "ensure integrity of dataset creation, the labeling logic must",
    "also be publicly accessible, as well as complete, accurate,",
    "and thorough documentation. We remark the findings of our",
    "study are confined to CICIDS-2017 and CSE-CIC-IDS-2018,",
    "the primary benchmark datasets for NIDS research in the last",
    "five years. It is unknown to what extent other datasets suffer",
    "similar problems. It is a significant undertaking to determine",
    "the correct ground-truth necessary to establish their validity as",
    "benchmark datasets.VI. T HREATS TO VALIDITY",
    "In this section, we take into consideration potential threats",
    "to the validity of this study. While our work allows for the",
    "correction of label errors and removal of artefacts at the post-",
    "processed levels, the datasets are not free of shortcomings.",
    "Alongside inherent limitations of datasets generated in syn-",
    "thetic environments, our work is unable to remediate issues",
    "at the raw .pcap level. For example, the misimplementation",
    "of the DoS Hulk attack renders it completely ineffective. This",
    "requires re-execution with corrected implementation tools on",
    "the original testbed architectures.",
    "Finally, while we carefully reverse engineered the corrected",
    "logic in both datasets over the course of many months, we",
    "acknowledge that analyzing datasets of this size is extremely",
    "challenging, and may contain small residual errors. By pub-",
    "lishing our labeling logic efforts and the accompanying doc-",
    "umentation (over 160 pages of analysis)2, we hope to foster",
    "future communication with the research community in order",
    "to address any future corrections. Our research team is glad",
    "to make periodic releases of datasets with added corrections",
    "identified by the research community.",
    "VII. C ONCLUSIONS AND FUTURE WORK",
    "Benchmark datasets are heavily depended upon by the re-",
    "search community to validate theoretical findings and track pro-",
    "gression in the state-of-the-art. NIDS dataset creation presents",
    "numerous challenges on account of the volume, heterogeneity,",
    "and complexity of network traffic, making the process labor",
    "intensive, and thus, prone to error. In this work we conducted",
    "an in-depth manual analysis of the CIC-IDS-2017 and CSE-",
    "CIC-IDS-2018 datasets to validate their integrity. Throughout",
    "our investigation, we uncovered a number of issues pertaining",
    "to feature generation and labeling.",
    "As a consequence of labeling inaccuracies, corruption of",
    "labels is significant for many attacks. For the entire datasets of",
    "CIC-IDS-2017 and CSE-CIC-IDS-2018, labeling errors totaled",
    "6.67% and 7.53% respectively. Corruption rates to some attacks",
    "exceeded 75%. Remediations to these issues resulted in altered",
    "learning representations that better reflect the characteristics",
    "of attacks, leading to their improved detection rates. Increased",
    "training stability for deep learning methods was also observed.",
    "We expect that the generalization capabilities will also be",
    "strengthened based on the recalibrated learning representations.",
    "To the research community, we provide reconstructed datasets,",
    "our reverse-engineered labeling logic, as well as comprehensive",
    "documentation detailing the summary of our investigations.",
    "Our next research priorities are focused on developing new",
    "methods for the automated detection of labeling errors in NIDS",
    "datasets. We envision this will assist in future dataset creation",
    "efforts, as well as providing a solution of label correction",
    "for datasets already published. We hope our public release of",
    "corrected datasets and their labeling logic will drive further",
    "research initiatives in this area.",
    "2https://intrusion-detection.distrinet-research.be/",
    "CNS2022/2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "ACKNOWLEDGMENTS",
    "Lisa Liu wishes to acknowledge the Commonwealth’s con-",
    "tribution, for the provision of support provided through an Aus-",
    "tralian Government Research Training Program (RTP) Schol-",
    "arship. Gints Engelen wishes to thank the Research Fund KU",
    "Leuven and by the Flemish Research Programme Cybersecurity",
    "for helping to fund this research.",
    "REFERENCES",
    "[1] “Lincoln lab datasets.” https://www.ll.mit.edu/r-d/datasets. Accessed:",
    "2022-2-6.",
    "[2] “KDD cup 99.” https://kdd.ics.uci.edu/databases/kddcup99/kddcup99.",
    "[3] J. McHugh, “Testing intrusion detection systems: a critique of the 1998",
    "and 1999 DARPA intrusion detection system evaluations as performed",
    "by lincoln laboratory,” ACM Trans. Inf. Syst. Secur., vol. 3, pp. 262–294,",
    "Nov. 2000.",
    "[4] V . Engen, J. Vincent, and K. Phalp, “Exploring discrepancies in findings",
    "obtained with the KDD cup ’99 data set,” Intell. Data Anal., vol. 15,",
    "pp. 251–276, Mar. 2011.",
    "[5] M. Tavallaee, E. Bagheri, W. Lu, and A. A. Ghorbani, “A detailed",
    "analysis of the KDD CUP 99 data set,” in 2009 IEEE Symposium on",
    "Computational Intelligence for Security and Defense Applications, pp. 1–",
    "6, July 2009.",
    "[6] N. Moustafa and J. Slay, “UNSW-NB15: a comprehensive data set for",
    "network intrusion detection systems (UNSW-NB15 network data set),”",
    "in2015 Military Communications and Information Systems Conference",
    "(MilCIS), pp. 1–6, Nov. 2015.",
    "[7] I. Sharafaldin, A. H. Lashkari, and A. A. Ghorbani, “Toward generating",
    "a new intrusion detection dataset and intrusion traffic characterization,”",
    "ICISSp, vol. 1, pp. 108–116, 2018.",
    "[8] “CSE-CIC-IDS2018 2018 dataset.” https://registry.opendata.aws/",
    "cse-cic-ids2018/.",
    "[9] N. Koroniotis, N. Moustafa, E. Sitnikova, and B. Turnbull, “Towards",
    "the development of realistic botnet dataset in the internet of things for",
    "network forensic analytics: Bot-IoT dataset,” Future Gener. Comput.",
    "Syst., vol. 100, pp. 779–796, Nov. 2019.",
    "[10] J. Guerra, C. Catania, and E. Veas, “Datasets are not enough: Challenges",
    "in labeling network traffic,” Oct. 2021.",
    "[11] G. Engelen, V . Rimmer, and W. Joosen, “Troubleshooting an intrusion",
    "detection dataset: the CICIDS2017 case study,” in 2021 IEEE Security",
    "and Privacy Workshops (SPW), pp. 7–12, May 2021.",
    "[12] A. Rosay, E. Cheval, F. Carlier, and P. Leroux, “Network intrusion",
    "detection: A comprehensive analysis of CIC-IDS2017,” in Proceedings",
    "of the 8th International Conference on Information Systems Security and",
    "Privacy, SCITEPRESS - Science and Technology Publications, 2022.",
    "[13] V . Kanimozhi and T. P. Jacob, “Artificial intelligence based network",
    "intrusion detection with Hyper-Parameter optimization tuning on the",
    "realistic cyber dataset CSE-CIC-IDS2018 using cloud computing,” in",
    "2019 International Conference on Communication and Signal Processing",
    "(ICCSP), pp. 0033–0036, Apr. 2019.",
    "[14] M. V . O. Assis, L. F. Carvalho, J. Lloret, and M. L. Proenc ¸a, “A",
    "GRU deep learning system against attacks in software defined networks,”",
    "Journal of Network and Computer Applications, vol. 177, p. 102942, Mar.",
    "[15] M. U. Ilyas and S. A. Alharbi, “Machine learning approaches to network",
    "intrusion detection for contemporary internet traffic,” Computing, Jan.",
    "[16] B. M. Serinelli, A. Collen, and N. A. Nijdam, “On the analysis of open",
    "source datasets: validating IDS implementation for well-known and zero",
    "day attack detection,” Procedia Comput. Sci., vol. 191, pp. 192–199, Jan.",
    "[17] R. S. Arslan, “FastTrafficAnalyzer: An efficient method for intrusion",
    "detection systems to analyze network traffic,” Dicle Univ. Tip Fakul.",
    "Derg., vol. 12, no. 4, pp. 565–572, 2021.",
    "[18] Q. R. S. Fitni and K. Ramli, “Implementation of ensemble learning",
    "and feature selection for performance improvements in Anomaly-Based",
    "intrusion detection systems,” in 2020 IEEE International Conference",
    "on Industry 4.0, Artificial Intelligence, and Communications Technology",
    "(IAICT), pp. 118–124, July 2020.[19] X. Li, W. Chen, Q. Zhang, and L. Wu, “Building auto-encoder intrusion",
    "detection system based on random forest feature selection,” Computers",
    "& Security, vol. 95, p. 101851, 2020.",
    "[20] J. Kim, J. Kim, H. Kim, M. Shim, and E. Choi, “Cnn-based network",
    "intrusion detection against denial-of-service attacks,” Electronics, vol. 9,",
    "no. 6, p. 916, 2020.",
    "[21] M. A. Ferrag, L. Maglaras, S. Moschoyiannis, and H. Janicke, “Deep",
    "learning for cyber security intrusion detection: Approaches, datasets, and",
    "comparative study,” Journal of Information Security and Applications,",
    "vol. 50, p. 102419, 2020.",
    "[22] L. D’hooge, T. Wauters, B. V olckaert, and F. De Turck, “Inter-dataset",
    "generalization strength of supervised machine learning methods for",
    "intrusion detection,” Journal of Information Security and Applications,",
    "vol. 54, p. 102564, Oct. 2020.",
    "[23] M. Verkerken, L. D’hooge, T. Wauters, B. V olckaert, and F. De Turck,",
    "“Towards model generalization for intrusion detection: Unsupervised ma-",
    "chine learning techniques,” Journal of Network and Systems Management,",
    "vol. 30, p. 12, Oct. 2021.",
    "[24] A. H. Lashkari, G. Draper-Gil, M. S. I. Mamun, and A. A. Ghorbani,",
    "“Characterization of tor traffic using time based features,” in ICISSp,",
    "pp. 253–262, 2017.",
    "[25] “CICFlowMeter.” https://github.com/ahlashkari/CICFlowMeter. Ac-",
    "cessed: 2022-2-22.",
    "[26] “IDS 2017.” https://www.unb.ca/cic/datasets/ids-2017.html. Accessed:",
    "2022-2-22.",
    "[27] “IDS 2018.” https://www.unb.ca/cic/datasets/ids-2018.html. Accessed:",
    "2022-2-22.",
    "[28] M. Ring, S. Wunderlich, D. Scheuring, D. Landes, and A. Hotho, “A",
    "survey of network-based intrusion detection data sets,” Comput. Secur.,",
    "vol. 86, pp. 147–167, Sept. 2019.",
    "[29] A. Thakkar and R. Lohiya, “A review of the advancement in intrusion",
    "detection datasets,” Procedia Comput. Sci., vol. 167, pp. 636–645, Jan.",
    "[30] J. L. Leevy and T. M. Khoshgoftaar, “A survey and analysis of intrusion",
    "detection models based on CSE-CIC-IDS2018 big data,” 2020.",
    "[31] J. V . V . Silva, N. R. de Oliveira, D. S. V . Medeiros, M. A. Lopez,",
    "and D. M. F. Mattos, “A statistical analysis of intrinsic bias of net-",
    "work security datasets for training machine learning mechanisms,” Ann.",
    "Telecommun., Feb. 2022.",
    "[32] L. D’hooge, T. Wauters, B. V olckaert, and F. De Turck, “Classification",
    "hardness for supervised learners on 20 years of intrusion detection data,”",
    "IEEE Access, vol. 7, pp. 167455–167469, 2019.",
    "[33] R. F. Bikmukhamedov and A. F. Nadeev, “Lightweight machine learn-",
    "ing classifiers of IoT traffic flows,” in 2019 Systems of Signal Syn-",
    "chronization, Generating and Processing in Telecommunications (SYN-",
    "CHROINFO), pp. 1–5, July 2019.",
    "[34] A. Sivanathan, H. H. Gharakheili, and V . Sivaraman, “Detecting be-",
    "havioral change of IoT devices using Clustering-Based network traffic",
    "modeling,” IEEE Internet of Things Journal, vol. 7, pp. 7295–7309, Aug.",
    "[35] R. Doshi, N. Apthorpe, and N. Feamster, “Machine learning DDoS",
    "detection for consumer internet of things devices,” in 2018 IEEE Security",
    "and Privacy Workshops (SPW), pp. 29–35, May 2018.",
    "[36] M. Zolanvari, M. A. Teixeira, L. Gupta, K. M. Khan, and R. Jain,",
    "“Machine Learning-Based network vulnerability analysis of industrial",
    "internet of things,” IEEE Internet of Things Journal, vol. 6, pp. 6822–",
    "6834, Aug. 2019.",
    "[37] V . Morfino and S. Rampone, “Towards Near-Real-Time intrusion detec-",
    "tion for IoT devices using supervised learning and apache spark,” 2020.",
    "[38] Huang, Qu, Jia, and Zhao, “O2u-net: A simple noisy label detection",
    "approach for deep neural networks,” Proc. IEEE.",
    "[39] L. Li, K. Jamieson, G. DeSalvo, A. Rostamizadeh, and A. Talwalkar,",
    "“Hyperband: a novel bandit-based approach to hyperparameter optimiza-",
    "tion,” J. Mach. Learn. Res., vol. 18, pp. 6765–6816, Jan. 2017.",
    "[40] C. Northcutt, L. Jiang, and I. Chuang, “Confident learning: Estimating",
    "uncertainty in dataset labels,” J. Artif. Intell. Res., vol. 70, pp. 1373–1411,",
    "Apr. 2021.",
    "[41] C. G. Northcutt, A. Athalye, and J. Mueller, “Pervasive label errors in",
    "test sets destabilize machine learning benchmarks,” Mar. 2021.",
    "[42] C. Zhang, S. Bengio, M. Hardt, B. Recht, and O. Vinyals, “Un-",
    "derstanding deep learning requires rethinking generalization,” CoRR,",
    "vol. abs/1611.03530, 2016.2022 IEEE Conference on Communications and Network Security (CNS)",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on April 28,2025 at 07:26:13 UTC from IEEE Xplore.  Restrictions apply.",
    "The CICFlowMeter is an open source tool that generates Biflows from pcap files, and extracts features from these flows.",
    "CICFlowMeter is a network traffic flow generator available from here . It can be used to generate bidirectional flows, where the first packet determines the forward (source to destination) and backward (destination to source) directions, hence the statistical time-related features can be calculated separately in the forward and backward directions. Additional functionalities include, selecting features from the list of existing features, adding new features, and controlling the duration of flow timeout.",
    "NOTE: TCP flows are usually terminated upon connection teardown (by FIN packet) while UDP flows are terminated by a flow timeout. The flow timeout value can be assigned arbitrarily by the individual scheme e.g., 600 seconds for both TCP and UDP.",
    "For citation in your works and also understanding CICFlowMeter (formerly ISCXFlowMeter) completely, you can find below published papers:",
    "Arash Habibi Lashkari, Gerard Draper-Gil, Mohammad Saiful Islam Mamun and Ali A. Ghorbani, \"Characterization of Tor Traffic Using Time Based Features\", In the proceeding of the 3rd International Conference on Information System Security and Privacy, SCITEPRESS, Porto, Portugal, 2017",
    "Gerard Drapper Gil, Arash Habibi Lashkari, Mohammad Mamun, Ali A. Ghorbani, \"Characterization of Encrypted and VPN Traffic Using Time-Related Features\", In Proceedings of the 2nd International Conference on Information Systems Security and Privacy(ICISSP 2016) , pages 407-414, Rome , Italy",
    "--------------------------------------------------------------",
    "List of extracted features and descriptions:",
    "Feature Name\t\t\t\tDescription",
    "Flow duration\t\t\tDuration of the flow in Microsecond",
    "total Fwd Packet\t\tTotal packets in the forward direction",
    "total Bwd packets\t\tTotal packets in the backward direction",
    "total Length of Fwd Packet\tTotal size of packet in forward direction",
    "total Length of Bwd Packet\tTotal size of packet in backward direction",
    "Fwd Packet Length Min \t\tMinimum size of packet in forward direction",
    "Fwd Packet Length Max \t\tMaximum size of packet in forward direction",
    "Fwd Packet Length Mean\t\tMean size of packet in forward direction",
    "Fwd Packet Length Std\t\tStandard deviation size of packet in forward direction",
    "Bwd Packet Length Min\t\tMinimum size of packet in backward direction",
    "Bwd Packet Length Max\t\tMaximum size of packet in backward direction",
    "Bwd Packet Length Mean\t\tMean size of packet in backward direction",
    "Bwd Packet Length Std\t\tStandard deviation size of packet in backward direction",
    "Flow Bytes/s\t\t\tNumber of flow bytes per second",
    "Flow Packets/s\t\t\tNumber of flow packets per second",
    "Flow IAT Mean\t\t\tMean time between two packets sent in the flow",
    "Flow IAT Std\t\t\tStandard deviation time between two packets sent in the flow",
    "Flow IAT Max\t\t\tMaximum time between two packets sent in the flow",
    "Flow IAT Min\t\t\tMinimum time between two packets sent in the flow",
    "Fwd IAT Min\t\t\tMinimum time between two packets sent in the forward direction",
    "Fwd IAT Max\t\t\tMaximum time between two packets sent in the forward direction",
    "Fwd IAT Mean\t\t\tMean time between two packets sent in the forward direction",
    "Fwd IAT Std\t\t\tStandard deviation time between two packets sent in the forward direction",
    "Fwd IAT Total   \t\tTotal time between two packets sent in the forward direction",
    "Bwd IAT Min\t\t\tMinimum time between two packets sent in the backward direction",
    "Bwd IAT Max\t\t\tMaximum time between two packets sent in the backward direction",
    "Bwd IAT Mean\t\t\tMean time between two packets sent in the backward direction",
    "Bwd IAT Std\t\t\tStandard deviation time between two packets sent in the backward direction",
    "Bwd IAT Total\t\t\tTotal time between two packets sent in the backward direction",
    "Fwd PSH flags\t\t\tNumber of times the PSH flag was set in packets travelling in the forward direction (0 for UDP)",
    "Bwd PSH Flags\t\t\tNumber of times the PSH flag was set in packets travelling in the backward direction (0 for UDP)",
    "Fwd URG Flags\t\t\tNumber of times the URG flag was set in packets travelling in the forward direction (0 for UDP)",
    "Bwd URG Flags\t\t\tNumber of times the URG flag was set in packets travelling in the backward direction (0 for UDP)",
    "Fwd Header Length\t\tTotal bytes used for headers in the forward direction",
    "Bwd Header Length\t\tTotal bytes used for headers in the backward direction",
    "FWD Packets/s\t\t\tNumber of forward packets per second",
    "Bwd Packets/s\t\t\tNumber of backward packets per second",
    "Packet Length Min \t\tMinimum length of a packet",
    "Packet Length Max\t\tMaximum length of a packet",
    "Packet Length Mean \t\tMean length of a packet",
    "Packet Length Std\t\tStandard deviation length of a packet",
    "Packet Length Variance  \tVariance length of a packet",
    "FIN Flag Count \t\t\tNumber of packets with FIN",
    "SYN Flag Count \t\t\tNumber of packets with SYN",
    "RST Flag Count \t\t\tNumber of packets with RST",
    "PSH Flag Count \t\t\tNumber of packets with PUSH",
    "ACK Flag Count \t\t\tNumber of packets with ACK",
    "URG Flag Count \t\t\tNumber of packets with URG",
    "CWR Flag Count \t\t\tNumber of packets with CWR",
    "ECE Flag Count \t\t\tNumber of packets with ECE",
    "down/Up Ratio\t\t\tDownload and upload ratio",
    "Average Packet Size \t\tAverage size of packet",
    "Fwd Segment Size Avg \t\tAverage size observed in the forward direction",
    "Bwd Segment Size Avg \t\tAverage size observed in the backward direction",
    "Fwd Bytes/Bulk Avg\t\tAverage number of bytes bulk rate in the forward direction",
    "Fwd Packet/Bulk Avg\t\tAverage number of packets bulk rate in the forward direction",
    "Fwd Bulk Rate Avg \t\tAverage number of bulk rate in the forward direction",
    "Bwd Bytes/Bulk Avg\t\tAverage number of bytes bulk rate in the backward direction",
    "Bwd Packet/Bulk Avg \t\tAverage number of packets bulk rate in the backward direction",
    "Bwd Bulk Rate Avg\t\tAverage number of bulk rate in the backward direction",
    "Subflow Fwd Packets\t\tThe average number of packets in a sub flow in the forward direction",
    "Subflow Fwd Bytes\t\tThe average number of bytes in a sub flow in the forward direction",
    "Subflow Bwd Packets\t\tThe average number of packets in a sub flow in the backward direction",
    "Subflow Bwd Bytes\t\tThe average number of bytes in a sub flow in the backward direction",
    "Fwd Init Win bytes\t\tThe total number of bytes sent in initial window in the forward direction",
    "Bwd Init Win bytes\t\tThe total number of bytes sent in initial window in the backward direction",
    "Fwd Act Data Pkts\t\tCount of packets with at least 1 byte of TCP data payload in the forward direction",
    "Fwd Seg Size Min\t\tMinimum segment size observed in the forward direction",
    "Active Min\t\t\tMinimum time a flow was active before becoming idle",
    "Active Mean\t\t\tMean time a flow was active before becoming idle",
    "Active Max\t\t\tMaximum time a flow was active before becoming idle",
    "Active Std\t\t\tStandard deviation time a flow was active before becoming idle",
    "Idle Min\t\t\tMinimum time a flow was idle before becoming active",
    "Idle Mean\t\t\tMean time a flow was idle before becoming active",
    "Idle Max\t\t\tMaximum time a flow was idle before becoming active",
    "Idle Std\t\t\tStandard deviation time a flow was idle before becoming active",
    "--------------------------------------------------------------------------------------",
    "Troubleshooting an Intrusion Detection Dataset:",
    "the CICIDS2017 Case Study",
    "Gints Engelen, Vera Rimmer, and Wouter Joosen",
    "imec-DistriNet, KU Leuven",
    "Leuven, Belgium",
    "Email:fﬁrstname.lastnameg@kuleuven.be",
    "Abstract —Numerous studies have demonstrated the effective-",
    "ness of machine learning techniques in application to network",
    "intrusion detection. And yet, the adoption of machine learning",
    "for securing large-scale network environments remains chal-",
    "lenging. The community acknowledges that network security",
    "presents unique challenges for machine learning, and the lack",
    "of training data representative of modern trafﬁc remains one",
    "of the most intractable issues. New attempts are continuously",
    "made to develop high quality benchmark datasets and proper",
    "data collection methodologies. The CICIDS2017 dataset is one",
    "of the recent results, created to meet the demanding criterion of",
    "representativeness for network intrusion detection.",
    "In this paper we revisit CICIDS2017 and its data collection",
    "pipeline and analyze correctness, validity and overall utility of",
    "the dataset for the learning task. During this in-depth analysis,",
    "we uncover a series of problems with trafﬁc generation, ﬂow",
    "construction, feature extraction and labelling that severely affect",
    "the aforementioned properties. We investigate the causes of these",
    "shortcomings and address most of them by applying an improved",
    "data processing methodology. As a result, more than 20 percent",
    "of original trafﬁc traces are reconstructed or relabelled. Machine",
    "learning benchmarks on the ﬁnal dataset demonstrate signiﬁcant",
    "improvements. Our study exempliﬁes how data collection issues",
    "may have enormous impact on model evaluation and provides",
    "recommendations for their anticipation and prevention.",
    "Index Terms—network intrusion detection, machine learning,",
    "benchmark dataset, data collection.",
    "I. I NTRODUCTION",
    "Network intrusion detection systems (NIDS) are security",
    "tools strategically deployed in a network environment that",
    "monitor and interpret internal and external trafﬁc in search",
    "for malicious activities. Advances in Machine Learning (ML)",
    "over the last decades have enabled NIDS to evolve from simple",
    "rule-based systems to intelligent automated decision-making",
    "engines powered by modern learning algorithms [1]. Despite",
    "signiﬁcant progress in ML-based defensive research, a lot of",
    "challenges are still open when it comes to NIDS solutions. For",
    "any data-driven technique, the role of high quality, representa-",
    "tive datasets cannot be underestimated",
    "this is especially true",
    "for NIDS research that has to account for high non-stationarity",
    "and strong heterogeneity of network trafﬁc, together with an",
    "uncontrollable production environment.",
    "In NIDS research, evaluation on benchmark datasets pri-",
    "marily serves a two-fold purpose: (i) real-world performance",
    "estimation of a particular algorithm, and (ii) consistent com-",
    "parison between different approaches. In this respect, quality",
    "of data has a decisive inﬂuence on valid outcomes of bothobjectives. Research has shown that many benchmark datasets",
    "do not adequately represent the real problem of network in-",
    "trusion detection, discrediting performance numbers achieved",
    "in laboratory conditions [1]. As a response, over the last 10",
    "years the community has collectively devised the criteria that",
    "reliable research trafﬁc data should meet [2]–[4]. These criteria",
    "can be seen as objectives of proper dataset generation, be that",
    "for capturing real trafﬁc or simulating attack scenarios.",
    "Recently, the Canadian Institute of Cybersecurity released",
    "a new dataset – CICIDS2017 [5] – with the aim to address",
    "some of the issues that plagued older datasets. CICIDS2017 is",
    "comprised of real trafﬁc generated through simulated interac-",
    "tions between hosts in a controlled infrastructure, which means",
    "that the resulting network trafﬁc retains basic limitations of a",
    "simulated environment. Nevertheless, the authors do a great",
    "effort to achieve heterogeneity, diversity and completeness",
    "of the dataset in order to maximize its utility for research",
    "purposes. Owing to that promise, CICIDS2017 is growing",
    "in usage in NIDS research [6]–[9]. Crucially, however, the",
    "dataset is largely taken at its face value, assuming that a",
    "modern dataset collected with the quality requirements in",
    "mind indeed satisﬁes these criteria. As a result, the studies",
    "use successful ML evaluations as a sole conﬁrmation of",
    "correctness of CICIDS2017, but do not explicitly validate these",
    "results by examining the data. The lack of dedicated analysis",
    "sheds uncertainty on the empirical and theoretical research",
    "results obtained when leveraging the dataset. We have revisited",
    "the properties of CICIDS2017 as a NIDS dataset and analyse",
    "to what extent it satisﬁes the declared requirements.",
    "Our contributions can be summarized as follows:",
    "\u000fWe perform a thorough methodological manual analysis",
    "of the raw CICIDS2017 dataset and its respective feature",
    "extraction tool in order to review the dataset creation",
    "pipeline, consisting of attack simulation, ﬂow construc-",
    "tion, labelling, feature extraction and ML benchmarking.",
    "Our investigation reveals errors in attack simulation,",
    "feature extraction, labelling and benchmarking of the",
    "dataset. Moreover, we ﬁnd out that more than 25% of all",
    "ﬂows in the dataset turn out to be meaningless artefacts",
    "carrying no real identifying characteristics. For several",
    "attack categories, their fraction reaches 50%, which is",
    "signiﬁcantly beyond an acceptable noise level. Further",
    "investigation conﬁrms that the issue is still present in the",
    "newest version of the dataset - CIC-CSE-DS2018.",
    "72021 IEEE Symposium on Security and Privacy Workshops",
    "© 2021, Gints Engelen. Under license to IEEE.",
    "DOI 10.1109/SPW53761.2021.000092021 IEEE Security and Privacy Workshops (SPW) | 978-1-6654-3732-5/20/$31.00 ©2021 IEEE | DOI: 10.1109/SPW53761.2021.00009",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on May 12,2025 at 14:12:10 UTC from IEEE Xplore.  Restrictions apply.",
    "\u000fWe analyse the negative impact of the dataset errors,",
    "artefacts and mislabelled traces on ML algorithms, and",
    "provide insights into why these issues can easily pass",
    "undetected when using the dataset for NIDS research.",
    "\u000fBuilding on these ﬁndings, we modify the feature extrac-",
    "tor and regenerate and relabel the CICIDS2017 dataset",
    "based on the original PCAPs1. Improved correctness and",
    "reliability of the regenerated dataset are further supported",
    "by ML benchmarks that reach the highest performance",
    "ever reported on these data.",
    "II. D ATASET & R ELATED WORK",
    "A NIDS dataset is considered reliable when it covers the",
    "following properties. It should contain (a) real and (b) valid",
    "network trafﬁc, such that it constitutes complete scenarios that",
    "can be observed in actual production environments. The benign",
    "and malicious traces should be (c) correctly labelled, (d)",
    "highly variant/diverse in terms of represented services, client",
    "behaviours and attacks, (e) correctly implemented, according",
    "to commonly accepted standards, and (f) easily updatable,",
    "when new services and attacks are introduced. The dataset",
    "should also be (g) reproducible, enabling comparison across",
    "different datasets, and (h) shareable, containing no private",
    "information. Finally, a good dataset should be supplied with",
    "(i) documentation and metadata of data collection, including",
    "details about the network infrastructure and simulated attack",
    "scenarios. CICIDS2017 was created as a response to these",
    "dataset quality evaluation criteria, and thus is asserted to",
    "satisfy all of them by design.",
    "The dataset is generated in a complete network topology",
    "with diverse devices and operating systems as a testbed, where",
    "separate victim and attacker networks communicate over the",
    "Internet. To collect benign trafﬁc that models realistic user",
    "behaviour, the authors use proﬁling agents [11] that are trained",
    "beforehand on network events generated through genuine",
    "human interactions in the network. Communication covers all",
    "common available protocols, such as HTTP, HTTPS, FTP,",
    "SSH and email protocols. In order to fulﬁl the requirement",
    "for attack diversity, the authors use the 2016 McAfee report to",
    "compose the list of most common attacks: Brute Force attacks,",
    "Heartbleed attack, Botnet communication, several variants of",
    "DoS attacks, DDoS, Inﬁltration attack and Web attacks. In",
    "total, the dataset comprises over 2.8 million trafﬁc traces",
    "categorized into 15 classes. Individual trafﬁc traces are repre-",
    "sented by a feature vector of 80 extracted high-level statistical",
    "features, manually engineered based on expert knowledge of",
    "trafﬁc characteristics relevant to intrusion detection.",
    "Since 2017, plenty of studies have deployed CICIDS2017",
    "(and its latest version CSE-CIC-IDS2018) for NIDS re-",
    "search [6]–[9]. The studied research problems span ML-",
    "assisted network intrusion detection, novelty detection,",
    "anomaly detection, online detection, with a large variety of",
    "learning algorithms and trafﬁc representations – raw PCAPs,",
    "1The regenerated dataset and modiﬁed feature extractor can be found at",
    "downloads.distrinet-research.be/WTMC2021 [10], where we also provide a",
    "more low-level documentation of all our changes.statistical features, graphs, etc. Recently, both datasets started",
    "being considered for adversarial ML research, such as evasion",
    "of botnet detection [12]. The conclusions reached by these",
    "studies largely rely on correctness and validity of the dataset",
    "in all its forms. There are studies that have analyzed features",
    "used in the dataset [13] and raised the issue of class imbal-",
    "ance [14]. However, these analyses do not address correctness",
    "and validity of the dataset – the properties that are strongly",
    "required to support any research results obtained from the data.",
    "III. M ANUAL ANALYSIS AND CORRECTIONS",
    "We select CICIDS2017 for in-depth analysis based not",
    "only on its growing adoption in the literature, but also on",
    "sufﬁcient transparency and reproducibility of its generation",
    "process. This section describes the main analysis of the dataset",
    "and its feature extraction tool. Our goal here is to revise the",
    "aforementioned properties of a good NIDS dataset, which we",
    "do through examining the following dataset creation stages:",
    "\u000fAttack simulation. Most research datasets for NIDS con-",
    "tain malicious traces representative of target malicious",
    "activities. To include a wide variety of attacks, and save",
    "the effort of annotating real trafﬁc, the attacks are often",
    "simulated with open source tools or custom scripts.",
    "\u000fFlow construction. Raw network trafﬁc is a continuous",
    "data stream that needs to be monitored and analyzed in",
    "real time. It is therefore necessary to decide what the",
    "level of granularity will be, i.e. what constitutes a single",
    "input unit for the detection system. Trafﬁc is commonly",
    "processed at granularity of a ﬂow associated with one",
    "complete network connection.",
    "\u000fLabelling. When working with a supervised detection",
    "system, the aim is not only to distinguish between be-",
    "nign and malicious trafﬁc, but to label malicious trafﬁc",
    "according to the attack class that it belongs to. When",
    "training an ML-based classiﬁer for this purpose, it needs",
    "to be supplied with example network data from all classes",
    "that it needs to be able to detect, along with the correct",
    "label for each input. When testing the model, comparing",
    "correct labels with predicted classes allows to assess the",
    "model’s performance.",
    "\u000fFeature extraction. Traditional ML systems cannot op-",
    "erate on multidimensional raw trafﬁc data, and instead",
    "require some form of structured input. Therefore, a ﬂow-",
    "based intrusion detection system would convert each",
    "raw trafﬁc ﬂow to a ﬁxed-length structured vector that",
    "encapsulates all the important information about the ﬂow",
    "in a form of numerical and/or categorical features. For",
    "instance, a NIDS could extract statistical features of the",
    "ﬂow, such as total ﬂow duration, total forward pack-",
    "ets, average inter-packet arrival time, maximum packet",
    "length, and others.",
    "\u000fML benchmarks. Since the dataset is meant for design",
    "and optimization of data-driven network security solu-",
    "tions, the ﬁnal stage of its creation is performing ML",
    "benchmarks. Benchmarking includes designing, training",
    "and testing one or more ML models on the constructed",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on May 12,2025 at 14:12:10 UTC from IEEE Xplore.  Restrictions apply.",
    "dataset for a lab evaluation of network intrusion detection.",
    "This stage is meant to conﬁrm that the dataset and its",
    "features are meaningful and appropriate for ML-based",
    "NIDS, and optionally to compare performance of various",
    "algorithms.",
    "Understanding the underlying mechanisms of dataset gen-",
    "eration enables researchers and practitioners to properly as-",
    "sess relevance of the data to the problem at hand, foresee",
    "potential pitfalls of applying ML to these data, and essentially",
    "set correct expectations. Dataset documentation is crucial in",
    "facilitating this analysis, and in case of CICIDS2017 we use",
    "several sources of documentation: (i) the original paper [5], (ii)",
    "the website page describing the dataset and its features [15],",
    "and (iii) the github page of the feature extraction tool [16].",
    "In the following, we describe our analysis process for each",
    "dataset generation stage of interest, in the order applied during",
    "our study, and report our ﬁndings.",
    "A. Flow construction",
    "CICIDS2017 ﬂows are constructed from raw PCAP ﬁles",
    "using the CICFlowMeter tool [16] by the same authors, which",
    "outputs CSV ﬁles where each row corresponds to a ﬂow,",
    "and each ﬂow has 83 (excluding the label) features. They",
    "deﬁne a ﬂow as a bidirectional exchange of network packets",
    "belonging to the same 5-tuple – a unique set fsource IP ad-",
    "dress, destination IP address, source port, destination port,",
    "transport layer protocolg – within a certain time period.",
    "1) TCP “appendices”. We analyze the source code of",
    "CICFlowMeter to understand how each ﬂow is recorded. A",
    "ﬂow is started upon observing a packet that does not belong",
    "to an active ﬂow. A ﬂow is terminated either upon timing out,",
    "or when the network connection is closed. In this dataset the",
    "timeout value was set to 120 seconds. When the underlying",
    "network protocol is TCP, CICFlowMeter also considers the",
    "network connection closed (and the corresponding ﬂow com-",
    "pleted) upon detecting the ﬁrst packet in the ﬂow that contains",
    "a FIN ﬂag. We notice that this design decision violates the",
    "TCP speciﬁcation [17] that stipulates that a FIN ﬂag merely",
    "indicates that the sender is done transmitting data. A TCP",
    "connection, however, is only terminated when both sides have",
    "sent a FIN packet to each other.",
    "The result of the misunderstanding of the TCP mechanism",
    "has rather drastic consequences: if a ﬂow is considered ter-",
    "minated already after the ﬁrst of the actual two FIN packets,",
    "any subsequent packets belonging to the same TCP connection",
    "will constitute their own ﬂow. These ﬂows mostly consist of",
    "just two leftover ACK and FIN packets and are labelled as the",
    "original ﬂow, be that benign or an attack. We will henceforth",
    "refer to these ﬂows as “TCP appendices”, since they constitute",
    "the (superﬂuous) end of the underlying TCP connection. In",
    "Section IV we show that the TCP appendices are alarmingly",
    "present, making up 25.9 percent of the entire dataset and study",
    "their impact.",
    "2) Timeout and TCP appendices. After a ﬂow times out, a",
    "subsequent ﬂow with the same 5-tuple maintains the source",
    "and destination of the timed out ﬂow, which guaranteesconsistency across multiple ﬂows spanning a single (long)",
    "TCP connection. There is however a complex problem in this",
    "dataset where a TCP appendix timing out can sometimes cause",
    "the subsequent ﬂow to go in the wrong direction (that is, the",
    "Source andDestination features of the ﬂow are swapped). A",
    "detailed description of this phenomenon is however out of",
    "scope for this work, and we once again refer the interested",
    "reader to our detailed documentation [10].",
    "As we will see in section III-B, the labelling logic used in",
    "this dataset relies on correct ﬂow direction to assign its labels.",
    "Consequently, when attack ﬂows go in the wrong direction,",
    "they risk being mislabelled as benign.",
    "3) Ignoring RST. According to the speciﬁcation [17], the",
    "RST packet is used to reset a TCP connection. We observe,",
    "however, that the CICFlowMeter tool does not consider the",
    "RST packet as a valid way to terminate a TCP ﬂow.",
    "B. Labelling",
    "The authors provide information about the IP addresses",
    "of attackers and victims as well as the time window during",
    "which each attack was executed, which should allow for",
    "reproducibility of the labelling logic.",
    "1) Time frames. We found that the time frames reported on",
    "the dataset information page [15] are not precise, therefore we",
    "had to tune them to reproduce the labelling. We report these",
    "details along with the new version of the dataset [10].",
    "2) Attempted attack ﬂows. A crucial observation is that the",
    "employed labelling strategy relies solely on a ﬂow’s source",
    "and destination IP and a speciﬁc data collection window, and",
    "thus labels a trafﬁc ﬂow between an attacker and a victim as",
    "malicious simply on the grounds of being collected at a certain",
    "moment in time. Consequently, a resulting ﬂow’s content and",
    "characteristics are not veriﬁed to ensure that malicious or",
    "suspicious activity is taking place.",
    "We found at least one potential issue with that, which affects",
    "most attack classes. All attacks, except for PortScan, rely on",
    "an established TCP connection in order to deploy malicious",
    "functionality. Within this established TCP connection, there",
    "needs to be some kind of communication in the form of a",
    "payload for the attack to take place.",
    "However, we observe that Web Attack - Brute Force andWeb",
    "Attack - XSS largely consist of ﬂows that have no data transfer",
    "in the forward direction, which means that the attacker never",
    "actually executes an attack within those ﬂows. Bottrafﬁc also",
    "contains a large number of failed or empty TCP connections,",
    "which do not contain meaningful botnet trafﬁc and thus should",
    "not be labelled as such. Moreover, when a DoS attack brings",
    "a web server down, making it unable to properly respond",
    "to new incoming connection requests, these numerous TCP",
    "connections without a HTTP payload are still labelled as an",
    "instance of a HTTP-based DoS attack.",
    "We conclude that labelling these examples as attacks is in-",
    "appropriate for the type of a ﬂow-based NIDS which analyzes",
    "each ﬂow in isolation from another and cannot judge whether",
    "an observed failed or empty TCP connection is a part of",
    "a larger ongoing malicious campaign. That is, CICIDS2017",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on May 12,2025 at 14:12:10 UTC from IEEE Xplore.  Restrictions apply.",
    "ﬂows that are generated by a connection initiated by an",
    "attack simulation tool but do not contain any forward data",
    "transfer should be distinguished from self-contained malicious",
    "connections. We thus decide to label these ﬂows as ‘X -",
    "Attempted’, where Xrefers to the original attack label (IV-B).",
    "C. Attack simulation",
    "Most attacks are generated by executing an automated tool",
    "from one or more hosts in the attacker network, while other",
    "attacks are executed by Python scripts written by the authors.",
    "Some attack categories (such as Bot, Inﬁltration) assume that",
    "the victim host is compromised, after which the victim will",
    "be initiating connections with the attacker.",
    "1) DoS Hulk misimplementation. Our analysis reveals that",
    "the DoS Hulk tool used in this dataset simulation is deprecated",
    "and should not be used to execute a DoS attack. The DoS Hulk",
    "tool aims to cause the target web-server to keep a connection",
    "open during 110-120 seconds. However, instead of setting the",
    "Connection header ﬁeld in the HTTP request to Keep-Alive,",
    "this implementation sets it to Close. As a result, the web server",
    "sets the FIN ﬂag on the outgoing HTTP response packet,",
    "initiating to close the connection. As this renders the DoS",
    "Hulk attack ineffective, we do not believe this attack class in",
    "CICIDS2017 can be used as intended.",
    "2) Diversity. The authors of the dataset ensure diversity",
    "in benign behaviour and include a wide range of attacks.",
    "However, diversity of data within each attack category is not",
    "openly discussed. We are not aware whether the attack tools",
    "were used with a certain ﬁxed conﬁguration or with varying",
    "parameters, which affects how representative each attack class",
    "is of the overall attack strategy. A supervised NIDS trained",
    "on attack traces that were simulated using one conﬁguration",
    "of the attack tool may not generalize to other conﬁgurations,",
    "making NIDS behaviour unpredictable on slightly differing",
    "attack implementations.",
    "For the sake of diversity within a single attack category, we",
    "recommend combining several tools and their conﬁgurations",
    "for attack simulation in future research.",
    "D. Feature extraction",
    "The dataset uses ﬂow-level statistical features as a traf-",
    "ﬁc representation. These features are calculated in the CI-",
    "CFlowMeter feature extraction tool.",
    "Shortcut learning. The original CSV ﬁles still contain",
    "attributes such as Flow ID, Source IP , Destination IP , Source",
    "Port, Destination Port, andTimestamp of the ﬂow. Whereas",
    "using the destination port as a NIDS feature is up for debate,",
    "the other attributes should be excluded from the feature",
    "representation during training. This should prevent a ﬂow-",
    "based NIDS from associating a certain timestamp or some",
    "host-speciﬁc information with a certain class without actually",
    "learning the underlying problem.",
    "This ties in to a larger problem in ML, where features",
    "unrelated to the underlying problem happen to be the most",
    "discerning between each class. This phenomenon is generally",
    "referred to as shortcut learning. While reliable detectionof shortcut learning is still an open research problem, we",
    "recommend analyzing the importance of various features used",
    "in prediction as a sanity check for any feature-based classiﬁer.",
    "We evaluate the issue of shortcut learning at length within",
    "the context of this dataset in Section IV.",
    "E. ML benchmarks",
    "The authors of CICIDS2017 evaluate standard ML classi-",
    "ﬁers [5]: Random Forest (RF), Multi-Layer Perceptron (MLP),",
    "K-Nearest Neighbors, etc. Apart from execution speed for",
    "training and testing, they report aggregated performance met-",
    "rics for the whole test set, based on the total number of true",
    "positives (TP), false positives (FP) and false negatives (FN):",
    "Precision: the ratio of correctly detected attacks to all traces",
    "classiﬁed as malicious TP= (TP +FP)",
    "Recall: the ratio of correctly detected attacks to all actually",
    "malicious traces TP= (TP +FN)",
    "F1-score: the harmonic mean of precision and recall.",
    "We list a number of issues with the conducted benchmarks,",
    "which affect reliability and reproducibility of reported perfor-",
    "mance estimates. First, the lack of per-class performance mea-",
    "surements, such as a confusion matrix or per-class F1-score,",
    "does not allow to fully assess utility of CICIDS2017 for NIDS.",
    "Providing only aggregated precision, recall and F1-score for",
    "a given highly imbalanced dataset obscures effectiveness of",
    "the ML algorithms for different attack classes. Our evaluation",
    "shows that a ML-based NIDS fails on numerous ﬂows of",
    "some of the attacks, encouraging deeper investigation. We",
    "provide revised ML benchmarks according to the suggested",
    "methodology in the next section.",
    "IV. E VALUATION",
    "In this section we evaluate a Random Forest (RF) classiﬁer",
    "on the original and corrected datasets and analyze the differ-",
    "ence. Through these benchmarks we also empirically inves-",
    "tigate the impact of TCP appendices and mislabelled traces",
    "on ML-based NIDS, and illustrate why it is so challenging to",
    "detect such errors.",
    "A. Regenerating the dataset",
    "We analyze the impact of improvements suggested in Sec-",
    "tion III by applying dataset transformations in three subsequent",
    "stages. Table I reports on the number of traces per category",
    "for each transformation step.",
    "1) Original. We reconstruct the Original dataset with the",
    "original CICFlowMeter tool and label it in such a way that it",
    "matches the public dataset version as closely as possible.",
    "2) Intermediate: ﬁxing TCP-related issues. We correct ﬂow",
    "construction errors (III-A) by ﬁxing CICFlowMeter so that the",
    "TCP appendices are systematically reunited with the “head”",
    "parts of the underlying TCP connections, while also making",
    "sure that an RST packet correctly terminates a ﬂow. Our goal",
    "here is to have TCP ﬂows accurately reﬂect their underlying",
    "TCP connection. Subsequently, we see a sharp decrease in",
    "ﬂow counts across most classes in the second column of",
    "Table I, where the biggest change happens in classes where",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on May 12,2025 at 14:12:10 UTC from IEEE Xplore.  Restrictions apply.",
    "TABLE I: Structures of the three versions of the dataset (the",
    "most prominent changes of ﬂow counts in bold blue). *The",
    "“attempted” category combines all Attempted attack ﬂows.",
    "Label Original Intermediate Final",
    "(appendices ﬁxed) (payload ﬁlter)",
    "BENIGN 2271326 1823964 1823964",
    "ATTEMPTED* 0 0 447362",
    "FTP-Patator 7934 3984 3973",
    "SSH-Patator 5898 2988 2980",
    "DoS GoldenEye 10293 7647 7567",
    "DoS Hulk 230124 159048 158469",
    "DoS Slowhttptest 5499 5109 1742",
    "DoS slowloris 5791 5707 4001",
    "Heartbleed 11 11 11",
    "Web Brute Force 1507 1365 151",
    "Web Attack XSS 652 679 27",
    "Web Attack SQL 21 12 12",
    "Inﬁltration 36 48 32",
    "Bot 1956 2208 738",
    "PortScan 158842 159023 159023",
    "DDoS 128022 95123 95123",
    "TCP connections most often ﬁnish with FIN packets. In some",
    "classes we also see an increase of the number of ﬂows. This",
    "happens on one hand due to the aforementioned RST packet",
    "ﬁx, as well as due to the issue described in section III-A2",
    "which caused some malicious traces to be mislabelled as",
    "benign, and which is resolved upon ﬁxing the TCP appendices.",
    "Note that we did not alter the original ﬂow timeout value.",
    "3) Final: payload ﬁlter. Following our conclusion in III-B2,",
    "we apply the payload ﬁlter to all classes except for Benign and",
    "PortScan. This ﬁlter ensures that attack classes predominantly",
    "contain ﬂows that actually exhibit malicious activity. We notice",
    "sharp drops in several categories (Table I).",
    "Web Attacks: Brute Force and XSS. Manual inspection of",
    "these attacks showed that the large majority of their ﬂows do",
    "not contain any packet data. The attacks are largely executed",
    "through a select few ﬂows, which each of them containing",
    "many brute force or XSS attempts.",
    "Bot. Manual inspection showed that when the infected",
    "victims attempt to connect to the Botnet master, they are",
    "rejected in 2 out of 3 cases. These rejected connections carry",
    "no meaningful malicious content, and were thus relabelled.",
    "DoS: Slowhttptest and Slowloris. With both attacks, our",
    "inspection reveals a large amount of failed TCP connections.",
    "Unlike with Bot, this can be explained by the attack strategy",
    "itself, which appears to have succeeded at bringing the victim",
    "server down, at which point it is no longer able to respond to",
    "incoming connection requests.",
    "B. Experimental results",
    "We perform ML benchmarks on the three dataset ver-",
    "sions following the evaluation methodology introduced in",
    "Section III-E and report results of RF – the classiﬁer with",
    "the best average F1-Score – in Table II. For these experiments",
    "we decided to assign all “Attempted” ﬂows to the BENIGN",
    "category. We used a train-test split of 75-25. For the source",
    "code, hyperparameter details and random seeds we refer the",
    "reader to our extended documentation [10]. Note that results",
    "of the analysis might differ based on the used ML model.TABLE II: RF classiﬁer performance metrics with the test set",
    "ratio 25% (the most impacted attack classes in bold blue).",
    "*Test sets of these classes are extremely small [10].Original Intermediate Final",
    "Label Pr Re F1 Pr Re F1 Pr Re F1",
    "BENIGN 0.99 0.99 0.99 0.99 0.99 0.99 0.99 0.99 0.99",
    "FTP-Patator 0.99 0.99 0.99 1.00 1.00 1.00 1.00 1.00 1.00",
    "SSH-Patator 0.99 0.98 0.99 1.00 0.99 0.99 1.00 0.99 0.99",
    "DoS GoldenEye 0.99 0.99 0.99 0.99 0.99 0.99 0.99 0.99 0.99",
    "DoS Hulk 0.99 0.99 0.99 0.99 0.99 0.99 1.00 0.99 0.99",
    "DoS Slowhttptest 0.98 0.99 0.98 0.97 0.99 0.98 0.99 0.99 0.99",
    "DoS slowloris 0.99 0.99 0.99 0.99 0.99 0.99 1.00 0.99 0.99",
    "Heartbleed* 1.00 0.67 0.77 1.00 0.67 0.78 1.00 0.89 0.93",
    "Web Brute Force 0.70 0.85 0.77 0.69 0.91 0.78 1.00 0.91 0.95",
    "Web Attack XSS* 0.52 0.11 0.18 0.52 0.16 0.25 1.00 0.67 0.79",
    "Web Attack SQL* 0.33 0.07 0.11 0.00 0.00 0.00 0.00 0.00 0.00",
    "Inﬁltration* 0.96 0.70 0.81 1.00 0.50 0.66 1.00 0.83 0.91",
    "Bot 0.92 0.45 0.60 0.79 0.40 0.53 1.00 0.99 0.99",
    "PortScan 0.99 0.99 0.99 0.96 0.97 0.97 0.96 0.97 0.97",
    "DDoS 0.99 0.99 0.99 1.00 1.00 1.00 1.00 1.00 1.00",
    "Accuracy 0.99 0.99 0.99",
    "Weighted Avg 0.99 0.99 0.99 0.99 0.99 0.99 0.99 0.99 0.99",
    "While the aggregated performance metrics at the bottom",
    "of Table II show no difference, the applied transformations",
    "have signiﬁcantly affected NIDS performance for various cat-",
    "egories. This illustrates why analyzing the imbalanced dataset",
    "at the level of aggregated ML metrics is inadequate.",
    "1) TCP appendix impact. We see that removing appendices",
    "marginally improves performance for some classes, but also",
    "gives a performance decrease for other classes. Note that Web",
    "Attack - SQL Injection ends up with 12 traces in total, and",
    "all 3 test traces are mispredicted as Benign. This may be",
    "due to the attack being hardly distinguishable from benign",
    "traces and poorly represented in the training data. For other",
    "classes where performance worsened, the appendices in the",
    "Original dataset are more likely to be classiﬁed correctly",
    "than normal attack ﬂows. This points to the model overﬁtting",
    "on the appendix instances, memorizing their features instead",
    "of learning actual attack patterns. The model will be able",
    "to overﬁt to such data only if (1) appendices of different",
    "attack classes can be differentiated, and (2) appendices can be",
    "distinguished from regular ﬂows of the same class. To assess",
    "whether these conditions hold, we apply extensive feature",
    "importance measurements for the RF classiﬁer, the details of",
    "which can be found online [10].",
    "TCP appendix features indeed have widely varying distribu-",
    "tions across different classes, and most importantly, in all cases",
    "these features do not have any semantic connection with the",
    "intended malicious activity, but rather stem from the speciﬁcs",
    "of the used attack tools. We ﬁnd that the model overﬁts",
    "through shortcut learning: it uses four prominent but largely",
    "irrelevant features to crisply differentiate between appendices",
    "of different classes (Fwd Header Len, Total Fwd Pkt, Min Seg",
    "Size Fwd, and Init Win bytes Fwd ), and mainly two features",
    "(SYN Flag Count, Bwd Pkt Len Mean) to separate appendices",
    "from regular ﬂows.",
    "2) Payload ﬁlter impact. The ﬁnal transformation through",
    "the targeted payload ﬁlter triggers a large change towards",
    "much higher performance on Brute Force, XSS and Bot at-",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on May 12,2025 at 14:12:10 UTC from IEEE Xplore.  Restrictions apply.",
    "tacks. This indicates that Bot ﬂows without an established TCP",
    "connection were a source of confusion for the RF classiﬁer.",
    "Our experiments revealed that the presence of RST packets",
    "was a learned shortcut for Bot trafﬁc in the Original dataset,",
    "which means that the classiﬁer learned to recognise failed TCP",
    "connections instead of actual Botnet trafﬁc. In the Final dataset",
    "with near-perfect benchmark results the absence of RST was",
    "an important Bot trafﬁc feature.",
    "We also see no signiﬁcant change in performance for DoS",
    "Slowhttptest, despite the large (almost 70%) decrease in total",
    "number of ﬂows. However, through additional feature impor-",
    "tance analysis we see that the model starts to learn actually",
    "relevant features, such as Inter-packet arrival time. Given that",
    "a DoS Slowhttptest attack sends intermittent fragmented HTTP",
    "packets, this feature is a strong indicator of this type of attack,",
    "and is something a human operator would look for as well.",
    "The experiments further conﬁrm that aggregated ML metrics",
    "computed on a largely imbalanced multi-class dataset are",
    "inadequate to judge its utility for NIDS. Class-based metrics,",
    "feature importance analysis and manual investigation of mis-",
    "predictions are crucial in performance evaluation and will aid",
    "in bringing attention to suspicious data points and spurious",
    "correlations that would otherwise have gone unnoticed.",
    "V. C ONCLUSION",
    "In this paper we revised the creation process of the widely",
    "adopted CICIDS2017 dataset. Through analyzing trafﬁc gen-",
    "eration, attack simulation, ﬂow construction, feature extrac-",
    "tion, labeling and benchmarking stages of data collection,",
    "we discovered a series of problems that violate some of",
    "the established properties of a high quality NIDS dataset.",
    "The misimplementation of the DoS Hulk attack, the misun-",
    "derstanding of the TCP protocol in ﬂow construction and",
    "errors in feature extraction by the ﬂawed CICFlowMeter tool",
    "violate the requirement for correct implementation of network",
    "trafﬁc. Notwithstanding the great effort by the CICIDS2017",
    "team to provide documentation on the infrastructure and data",
    "collection, we observed a lack of documentation concerning",
    "ﬂow construction and parameters of attacks. Moreover, an",
    "overly general labelling strategy without additional validation",
    "of malicious traces caused a signiﬁcant number of ﬂows",
    "to be mislabelled. We correct the CICFlowMeter tool, and",
    "regenerate and relabel the new version of CICIDS2017 based",
    "on the original trafﬁc. Reﬁned machine learning benchmarks",
    "and feature importance analysis indicate improved validity and",
    "utility of the dataset. Crucially, our preliminary investigation",
    "into CSE-CIC-IDS2018, the successor of CICIDS2017, also",
    "revealed errors in ﬂow construction. We strongly recommend",
    "to further analyze this dataset and only use the corrected",
    "version of CICFlowMeter for ﬂow-based analysis.",
    "We introduced an “Attempted” label for each attack class in",
    "order to decouple intent from effect. As this dichotomy applies",
    "to many security datasets, future research should investigate",
    "its other possible sources and devise appropriate practices.",
    "Our analysis provides more insight into the process of",
    "dataset creation, which not only allows one to make informeddecision when selecting data for lab evaluations, but also –",
    "crucially – sets correct expectations and overall contributes",
    "to designing better security solutions. We expect our ﬁndings",
    "and recommendations to support researchers and practitioners",
    "in the pursuit of better datasets and evaluation approaches.",
    "VI. A CKNOWLEDGMENTS",
    "We thank Jin Li for providing us with the labelling code.",
    "We also thank Lieven Desmet for proofreading the paper and",
    "for his helpful insights, and the reviewers for their valuable",
    "suggestions. This research is funded by the Research Fund KU",
    "Leuven and by the Flemish Research Programme Cybersecu-",
    "REFERENCES",
    "[1] H. Hindy, D. Brosset, E. Bayne, A. K. Seeam, C. Tachtatzis, R. Atkin-",
    "son, and X. Bellekens, “A taxonomy of network threats and the effect",
    "of current datasets on intrusion detection systems,” IEEE Access, vol. 8,",
    "pp. 104 650–104 675, 2020.",
    "[2] I. Sharafaldin, A. Gharib, A. H. Lashkari, and A. A. Ghorbani, “Towards",
    "a reliable intrusion detection benchmark dataset,” Software Networking,",
    "vol. 2018, no. 1, pp. 177–200, 2018.",
    "[3] E. K. Viegas, A. O. Santin, and L. S. Oliveira, “Toward a reliable",
    "anomaly-based intrusion detection in real-world environments,” Com-",
    "puter Networks, vol. 127, pp. 200–216, 2017.",
    "[4] M. Ring, S. Wunderlich, D. Scheuring, D. Landes, and A. Hotho, “A",
    "survey of network-based intrusion detection data sets,” Computers &",
    "Security, vol. 86, pp. 147–167, 2019.",
    "[5] I. Sharafaldin, A. H. Lashkari, and A. A. Ghorbani, “Toward generating",
    "a new intrusion detection dataset and intrusion trafﬁc characterization.”",
    "inICISSP, 2018, pp. 108–116.",
    "[6] L. Leichtnam, E. Totel, N. Prigent, and L. M ´e, “Sec2graph: Network",
    "attack detection based on novelty detection on graph structured data,” in",
    "International Conference on Detection of Intrusions and Malware, and",
    "Vulnerability Assessment. Springer, 2020, pp. 238–258.",
    "[7] A. Rosay, F. Carlier, and P. Leroux, “MLP4NIDS: An efﬁcient MLP-",
    "Based network intrusion detection for CICIDS2017 dataset,” in Inter-",
    "national Conference on Machine Learning for Networking. Springer,",
    "2019, pp. 240–254.",
    "[8] D. Stiawan, M. Y . B. Idris, A. M. Bamhdi, R. Budiarto et al., “CICIDS-",
    "2017 dataset feature analysis with information gain for anomaly detec-",
    "tion,” IEEE Access, vol. 8, pp. 132 911–132 921, 2020.",
    "[9] J. L. Leevy and T. M. Khoshgoftaar, “A survey and analysis of intrusion",
    "detection models based on CSE-CIC-IDS2018 big data,” Journal of Big",
    "Data, vol. 7, no. 1, pp. 1–19, 2020.",
    "[10] “Extended documentation of the corrected CICFlowMeter, generated",
    "CICIDS dataset, and the source code of the paper,” https://downloads.",
    "distrinet-research.be/WTMC2021.",
    "[11] A. Gharib, I. Sharafaldin, A. H. Lashkari, and A. A. Ghorbani, “An eval-",
    "uation framework for intrusion detection dataset,” in 2016 International",
    "Conference on Information Science and Security (ICISS). IEEE, 2016,",
    "pp. 1–6.",
    "[12] G. Apruzzese, M. Colajanni, and M. Marchetti, “Evaluating the effec-",
    "tiveness of adversarial attacks against botnet detectors,” in 2019 IEEE",
    "18th International Symposium on Network Computing and Applications",
    "(NCA). IEEE, 2019, pp. 1–8.",
    "[13] I. Sharafaldin, A. H. Lashkari, and A. A. Ghorbani, “A detailed analysis",
    "of the CICIDS2017 data set,” in International Conference on Informa-",
    "tion Systems Security and Privacy. Springer, 2018, pp. 172–188.",
    "[14] A. Abdullah Alfrhan, R. Hamad Alhusain, and R. Ulah Khan, “SMOTE:",
    "Class imbalance problem in intrusion detection system,” in 2020 Inter-",
    "national Conference on Computing and Information Technology (ICCIT-",
    "1441), 2020, pp. 1–5.",
    "[15] C. I. for Cybersecurity, “Intrusion detection evaluation dataset (CI-",
    "CIDS2017),” https://www.unb.ca/cic/datasets/ids-2017.html, 2017, ac-",
    "cessed: 2021-01-22.",
    "[16] “CICFlowMeter tool,” https://www.unb.ca/cic/research/applications.",
    "html, accessed: 2021-01-09.",
    "[17] J. Postel et al., “RFC 793: Transmission control protocol speciﬁcation,”",
    "Authorized licensed use limited to: SHANGHAI UNIVERSITY. Downloaded on May 12,2025 at 14:12:10 UTC from IEEE Xplore.  Restrictions apply.",
    "入侵检测评估数据集 （CIC-IDS2017）",
    "入侵检测系统 （IDS） 和入侵防御系统 （IPS） 是抵御复杂且不断增长的网络攻击的最重要防御工具",
    "由于缺乏可靠的测试和验证数据集，基于异常的入侵检测方法正在遭受一致且准确的性能演变",
    "我们对 1998 年以来现有的 11 个数据集的评估表明，大多数数据集都已经过时且不可靠",
    "其中一些数据集缺乏流量多样性和数量，一些没有涵盖各种已知攻击，而另一些则对数据包有效载荷数据进行匿名化处理，无法反映当前趋势",
    "有些还缺少功能集和元数据",
    "CICIDS2017数据集包含良性和最新的常见攻击，类似于真实的真实数据 （PCAP）",
    "它还包括使用 CICFlowMeter 进行网络流量分析的结果，其中包含基于时间戳、源和目标 IP、源和目标端口、协议和攻击（CSV 文件）的标记流",
    "生成真实的后台流量是我们构建此数据集的首要任务",
    "我们使用了我们提出的 B-Profile 系统（Sharafaldin 等人，2016 年）来描述人类交互的抽象行为，并生成自然的良性背景流量",
    "对于这个数据集，我们基于 HTTP、HTTPS、FTP、SSH 和电子邮件协议构建了 25 个用户的抽象行为",
    "数据采集期从 2017 年 7 月 3 日星期一上午 9 点开始，到 2017 年 7 月 7 日星期五下午 5 点结束，共计 5 天",
    "周一是正常的一天，仅包括良通",
    "实施的攻击包括蛮力 FTP、蛮力 SSH、DoS、Heartbleed、Web 攻击、渗透、僵尸网络和 DDoS",
    "他们已在周二、周三、周四和周五的上午和下午被处决",
    "在我们最近的数据集评估框架（Gharib et al.， 2016）中，我们确定了构建可靠基准数据集所需的 11 项标准",
    "以前的 IDS 数据集都无法涵盖所有 11 项标准",
    "在下文中，我们简要概述了这些标准：",
    "完成网络配置：完整的网络拓扑包括调制解调器、防火墙、交换机、路由器以及各种作系统，例如 Windows、Ubuntu 和 Mac OS X",
    "完成流量：通过在受害者网络中拥有用户分析代理和 12 台不同的机器以及来自攻击网络的真实攻击",
    "标记数据集：第 4 节和表 2 显示了每天的良性和攻击标签",
    "此外，攻击时间的详细信息将在数据集文档中发布",
    "完成交互：如图 1 所示，我们通过拥有两个不同的网络和 Internet 通信来覆盖内部 LAN 内部和之间",
    "完成捕获：因为我们使用了镜像端口，比如 tapping 系统，所以所有的流量都被捕获并记录在存储服务器上",
    "可用协议：提供所有常见的可用协议，例如 HTTP、HTTPS、FTP、SSH 和电子邮件协议",
    "攻击多样性：包括基于 2016 年 McAfee 报告的最常见攻击，例如此数据集中涵盖的基于 Web 的攻击、暴力攻击、DoS、DDoS、渗透攻击、Heart-bleed、爬虫程序和扫描",
    "异质性：在攻击执行期间，捕获了来自主 Switch 的网络流量，以及来自所有受害者计算机的内存转储和系统调用",
    "功能集：使用 CICFlowMeter 从生成的网络流量中提取 80 多个网络流特征，并将网络流数据集以 CSV 文件的形式交付",
    "请参阅我们的 PCAP 分析器和 CSV 生成器",
    "元数据：完整解释了已发表论文中的数据集，包括时间、攻击、流量和标签",
    "概述数据集及其基本原理的详细信息的完整研究论文：",
    "• Iman Sharafaldin、Arash Habibi Lashkari 和 Ali A. Ghorbani，“生成新的入侵检测数据集和入侵流量特征”，第 4 届信息系统安全和隐私国际会议 （ICISSP），Purtogal，2018 年 1 月",
    "日期、描述、大小 （GB）",
    "• 周一， 正常活动， 11.0G",
    "• 星期二，攻击 + 正常活动，11G",
    "• 星期三，攻击 + 正常活动，13G",
    "• 星期四，攻击 + 正常活动，7.8G",
    "• 周五，攻击 + 正常活动，8.3G",
    "受害者和攻击者网络信息",
    "防火墙：205.174.165.80、172.16.0.1",
    "DNS+ DC 服务器：192.168.10.3",
    "外部人员（攻击者网络）",
    "• 卡利：205.174.165.73",
    "• 胜：205.174.165.69、70、71",
    "Insiders （受害者网络）",
    "• Web 服务器 16 公共：192.168.10.50、205.174.165.68",
    "• Ubuntu 服务器 12 公共版：192.168.10.51、205.174.165.66",
    "• Ubuntu 14.4、32B：192.168.10.19",
    "• Ubuntu 14.4、64B：192.168.10.17",
    "• Ubuntu 16.4、32B：192.168.10.16",
    "• Ubuntu 16.4、64B：192.168.10.12",
    "• Win 7 专业版，64B：192.168.10.9",
    "• 胜 8.1、64B：192.168.10.5",
    "• Win Vista，64B：192.168.10.8",
    "• Win 10，专业版 32B：192.168.10.14",
    "• 赢 10、64B：192.168.10.15",
    "• MAC地址：192.168.10.25",
    "2017 年 7 月 3 日（星期一）",
    "良性（正常的人类活动）",
    "2017 年 7 月 4 日（星期二）",
    "FTP Patator （上午 9：20 – 10：20）",
    "SSH-Patator （下午 14：00 – 15：00）",
    "攻击者：Kali，205.174.165.73",
    "受害者：WebServer Ubuntu，205.174.165.68（本地 IP：192.168.10.50）",
    "防火墙上的 NAT 进程：",
    "攻击：205.174.165.73 -> 205.174.165.80（防火墙有效 IP）-> 172.16.0.1 -> 192.168.10.50",
    "回复： 192.168.10.50 -> 172.16.0.1 -> 205.174.165.80 -> 205.174.165.73",
    "2017 年 7 月 5 日星期三",
    "DoS / DDoS",
    "DoS slowloris （上午 9：47 – 10：10）",
    "DoS 慢httptest （上午 10：14 – 10：35）",
    "DoS 绿巨人（上午 10：43 – 11 点）",
    "DoS GoldenEye（上午 11：10 – 11：23）",
    "攻击者：Kali，205.174.165.73",
    "受害者：WebServer Ubuntu，205.174.165.68（本地 IP192.168.10.50）",
    "防火墙上的 NAT 进程：",
    "攻击：205.174.165.73 -> 205.174.165.80（防火墙有效 IP）-> 172.16.0.1 -> 192.168.10.50",
    "回复： 192.168.10.50 -> 172.16.0.1 -> 205.174.165.80 -> 205.174.165.73",
    "Heartbleed 端口 444 （15：12 - 15：32）",
    "攻击者：Kali，205.174.165.73",
    "受害者：Ubuntu12、205.174.165.66（本地 IP192.168.10.51）",
    "防火墙上的 NAT 进程：",
    "攻击：205.174.165.73 -> 205.174.165.80（防火墙有效 IP）-> 172.16.0.11 -> 192.168.10.51",
    "回复： 192.168.10.51 -> 172.16.0.1 -> 205.174.165.80 -> 205.174.165.73",
    "2017 年 7 月 6 日星期四",
    "网络攻击 – 蛮力（上午 9：20 – 10 点）",
    "Web 攻击 – XSS（上午 10：15 – 10：35）",
    "Web 攻击 – SQL 注入 （上午 10：40 – 10：42）",
    "攻击者：Kali，205.174.165.73",
    "受害者：WebServer Ubuntu，205.174.165.68（本地 IP192.168.10.50）",
    "防火墙上的 NAT 进程：",
    "攻击：205.174.165.73 -> 205.174.165.80（防火墙有效 IP）-> 172.16.0.1 -> 192.168.10.50",
    "回复： 192.168.10.50 -> 172.16.0.1 -> 205.174.165.80 -> 205.174.165.73",
    "渗透 – Dropbox 下载",
    "Meta 利用 Win Vista（下午 14：19 和 14：20-14：21）和（14：33 -14：35）",
    "攻击者：Kali，205.174.165.73",
    "受害者：Windows Vista，192.168.10.8",
    "渗透 – 冷盘 – MAC（下午 14：53 – 下午 15：00）",
    "攻击者：Kali，205.174.165.73",
    "受害者：MAC，192.168.10.25",
    "渗透 – Dropbox 下载",
    "Win Vista （下午 15：04 – 15：45）",
    "攻击者：Kali，205.174.165.73",
    "受害者：Windows Vista，192.168.10.8",
    "第二步 （Portscan + Nmap）：",
    "攻击者：Vista， 192.168.10.8",
    "受害者：所有其他客户端",
    "2017 年 7 月 7 日星期五",
    "僵尸网络 ARES （上午 10：02 – 上午 11：02）",
    "攻击者：Kali，205.174.165.73",
    "受害者：Win 10， 192.168.10.15 + Win 7， 192.168.10.9 + Win 10， 192.168.10.14 + Win 8， 192.168.10.5 + Vista， 192.168.10.8",
    "防火墙规则开启（13：55 – 13：57、13：58 – 14：00、14：01 – 14：04、14：05 – 14：07、14：08 - 14：10、14：11 – 14：13、14：14 – 14：16、14：17 – 14：19、14：20 – 14：21、14：22 – 14：24、14：33 – 14：33、14：35 - 14：35）",
    "防火墙规则失效（sS 14：51-14：53， sT 14：54-14：56， sF 14：57-14：59， sX 15：00-15：02， sN 15：03-15：05， sP 15：06-15：07， sV 15：08-15：10， sU 15：11-15：12， sO 15：13-15：15， sA 15：16-15：18， sW 15：19-15：21， sR 15：22-15：24， sL 15：25-15：25， sI 15：26-15：27， b 15：28-15：29）",
    "攻击者：Kali，205.174.165.73",
    "受害者：Ubuntu16、205.174.165.68（本地 IP：192.168.10.50）",
    "防火墙上的 NAT 进程：",
    "攻击者：205.174.165.73 -> 205.174.165.80（防火墙有效 IP）-> 172.16.0.1",
    "DDoS LOIT （15：56 – 16：16）",
    "攻击者： 三赢 8.1， 205.174.165.69 - 71",
    "受害者：Ubuntu16、205.174.165.68（本地 IP：192.168.10.50）",
    "防火墙上的 NAT 进程：",
    "攻击者：205.174.165.69、70、71 -> 205.174.165.80（防火墙有效 IP）-> 172.16.0.1",
    "数据集使用的网络研讨会示例：“通过迁移学习和集成学习方法增强 DDoS 攻击检测系统中的泛化性”，由加拿大网络安全研究所博士后研究员 Mahdi Rabbani 博士主持，并与 Windhya Rankothge 博士进行问答",
    "CICIDS2017 数据集由标记的网络流（包括 pcap 格式的完整数据包有效负载）、相应的配置文件和标记流 （GeneratedLabelledFlows.zip） 和用于机器学习和深度学习目的 （MachineLearningCSV.zip） 的 CSV 文件组成，可供研究人员公开使用",
    "如果您正在使用我们的数据集，您应该引用我们的相关论文，其中概述了数据集的详细信息及其基本原理：",
    "• Iman Sharafaldin、Arash Habibi Lashkari 和 Ali A. Ghorbani，“生成新的入侵检测数据集和入侵流量特征”，第 4 届信息系统安全和隐私国际会议 （ICISSP），葡萄牙，2018 年 1 月",
    "如果您对 CIC-IDS2017 感兴趣，您可能还对约克大学以行为为中心的网络安全中心的同事提供的 BCCC-CIC-IDS2017 数据集感兴趣"
  ],
  "text_to_doc_mapping": [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5
  ],
  "documents": [
    {
      "source": "CIC-IDS2017介绍.md",
      "file_path": "rag_data\\CIC-IDS2017介绍.md"
    },
    {
      "source": "网络攻击类型.txt",
      "file_path": "rag_data\\网络攻击类型.txt"
    },
    {
      "source": "3Error_Prevalence_in_NIDS_datasets_A_Case_Study_on_CIC-IDS-2017_and_CSE-CIC-IDS-2018.pdf",
      "file_path": "rag_data\\3Error_Prevalence_in_NIDS_datasets_A_Case_Study_on_CIC-IDS-2017_and_CSE-CIC-IDS-2018.pdf"
    },
    {
      "source": "CICFlowmeter.txt",
      "file_path": "rag_data\\CICFlowmeter.txt"
    },
    {
      "source": "4Troubleshooting_an_Intrusion_Detection_Dataset_the_CICIDS2017_Case_Study.pdf",
      "file_path": "rag_data\\4Troubleshooting_an_Intrusion_Detection_Dataset_the_CICIDS2017_Case_Study.pdf"
    },
    {
      "source": "CIC-IDS2017.txt",
      "file_path": "rag_data\\CIC-IDS2017.txt"
    }
  ],
  "embedding_dimension": 768,
  "created_at": "2025-11-24T18:36:01.984064"
}